console.log(
    '%c 1.Що таке асинхронність? ',
    'color: white; background-color: #D33F49',
);

//! Що таке асинхронність?
//? ✳️ Увесь код виконується процесором вашого комп'ютера.
//? Код, який ми писали досі, був синхронним,
//? тобто займав процесор на увесь час свого виконання.
//? Наприклад, швидкість виконання циклу для ітерації
//? по масиву залежить від швидкості процесора.

//? ✴️ Є операції, які взаємодіють із зовнішнім світом.
//? Наприклад, обмін даними з сервером у мережі,
//? що набагато повільніше, ніж отримання їх з пам'яті.
//? Якщо такі операції обробляються синхронно,
//? то процесор простоює під час мережевого запиту
//? на сервер замість того, щоб виконувати інший код.

//? ✴️⏩ Синхронний код виконується послідовно,
//? кожна інструкція очікує, доки виконається попередня.
//? Коли ви викликаєте функцію, яка виконує тривалу дію,
//? це зупиняє програму на увесь час її виконання.
//? Тобто в моделі синхронного програмування все відбувається по черзі.

//?⚠️ ⏩ ПРИКЛАД Синхронних операцій:
//?⚠️ Уявіть чергу придбання квитків на потяг.
//?⚠️ Ви не можете почати купувати квиток доти, доки квиток
//?⚠️ не придбає людина перед вами. Точно так само люди,
//?⚠️ які стоять за вами, не можуть почати купувати квитки доти, доки ви не купите.

//? ✴️🔂 В асинхронному коді одночасно можуть виконуватися декілька операцій.
//? У такій моделі мережевий запит на сервер не зупинить програму,
//? вона продовжить виконувати інші операції.
//? Коли запит завершиться, програма повідомляється про це
//? і отримує доступ до результату (наприклад, даних з серверу).

//?⚠️ ⏩ ПРИКЛАД Асинхронних операцій:
//?⚠️ Уявіть обід в ресторані. Ви та інші відвідувачі замовляєте їжу.
//?⚠️ Вам не потрібно чекати, доки їм принесуть їжу, перш ніж замовляти.
//?⚠️ Точно так само інші відвідувачі не повинні чекати,
//?⚠️  доки ви отримаєте свою страву і поїсте, перш ніж вони зможуть замовити.
//?⚠️ Кожен отримає свою страву, щойно її завершать готувати.

//? ✳️ Розглянемо різницю на прикладі, в якому програма
//? виконує два мережевих запити на сервер, після чого
//? обробляє їх результат. Операції 1 і 2 - це функції,
//? які роблять запити на сервер,
//? а 3, 4 і 5 - будь-який інший звичний для вас код.
console.warn(`Синхронні та Асинхронні операції​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_10/images/sync-vs-async.png"}`);
//? ✳️ У синхронній моделі все зрозуміло і досить сумно
//? - попередні операції блокують виконання наступних,
//? доки вони не завершаться.
//? Якщо операції 3-5 - це обробка кліків користувача,
//? то інтерфейс просто зависне, доки не будуть виконані
//? і оброблені результати запитів 1-2.

//? ✴️ Тобто за одиницю часу, як і раніше, може виконуватися 
//? тільки одна операція, тому що JavaScript - однопотокова мова. 
//? Асинхронне програмування досягається шляхом 
//? відкладених викликів функцій, де ініціалізація асинхронної операції 
//? і обробка її результату - це різні дії.

console.log(
    `%c
    Асинхронне програмування досягається шляхом
    відкладених викликів функцій,
    де ініціалізація асинхронної операції
    і обробка її результату - це різні дії.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------");
