console.log(
    '%c 4.Таймер: setTimeout() ',
    'color: white; background-color: #D33F49',
);

//! Таймер: setTimeout()
//? ✳️ Внутрішній таймер-планувальник браузера
//? дозволяє відкладати виклик функції на певний період часу.
//? Для цього є тайм-аути та інтервали, які контролюють,
//? коли і як часто викликається функція.
//? Таймери реалізовані в браузері, а не вбудовані в мову,
//? і доступні на глобальному об'єкті window.

//? 📌 Метод setTimeout() дозволяє запланувати
//? запуск функції через певний час:
//? 🔸 callback - функція, виконання якої необхідно запланувати.
//? 🔸 delay - час в мілісекундах, через який
//?    callback-функція буде викликана один раз.

//? ✳️ Додаткові аргументи (arg1, arg2 тощо) будуть передані 
//? callback-функції під час виклику. 
//? Повертає цифровий ідентифікатор створеного таймера, 
//? який використовується для його видалення.
console.log(
    `%c
    const timerId = setTimeout(callback, delay, arg1, arg2, ...);
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------");


//! Приклад-1: setTimeout()
console.warn("Приклад-1: setTimeout():");
const button = document.querySelector(".btn-set-interval");

const onClick = () => {
    const timerId = setTimeout(() => {
        console.log("Реакція на клік в кнопку <Click setInterval> через 5 секунд");
    }, 5000);

    console.log("timerId:", timerId);

    //! Що спрацює раніше: console.warn() або setTimeout(() => {console.log()}, 5000);
    // alert("⏳ Підтвердіть продовження віконання коду!"); //!
    // console.warn("✅ Підтвердено продовження віконання коду!"); //!
};

button.addEventListener("click", onClick);
console.log("-------------------------------------------------------------------------------------------------");


//! Приклад-2: setTimeout()
console.warn("Приклад-2: setTimeout():");
//? ✳️ Оскільки ми викликали clearTimeout(),
//? який виповниться раніше, ніж буде викликана функція greet(),
//? таймер з timerId буде видалений і
//? реєстрація відкладеного виклику greet() скасується.
//? Тому в консоль нічого не виведеться.
const greet = () => {
    console.log("Hello!");
    // clearTimeout(timerId); //! ✅ Видалення таймера
};

const timerId = setTimeout(greet, 2000);

//! ❌ Видалення таймера
clearTimeout(timerId);
console.log("-------------------------------------------------------------------------------------------------");
