console.log(
    '%c 1.Протокол HTTP.  \n   Протокол HTTPS. ',
    'color: white; background-color: #D33F49',
);

//! Обмін даними
console.warn(`Обмін даними​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/client-server.png"}`);
//? ✴️ Перед тим як користувач побачить вміст сайту на екрані,
//? браузер робить запит на сервер, щоб отримати цей вміст.
//? HTML-файл, зображення, стилі і скрипти приходять
//? з сервера по HTTP протоколу - набору правил і домовленостей,
//? що використовуються при передачі даних в мережі.
console.log(
    `%c
    Перед тим як користувач побачить вміст сайту на екрані,
    Браузер робить запит на Сервер, щоб отримати цей вміст.

    Тобото, між Браузером та Сервером(користувачем)
    відбувається обмін даними.
    `,
    'color: blue; font-size: 18px',
);
console.log("-----------------------------------------------------------------------------------------");


//! Протокол HTTP​​
console.warn(`Протокол HTTP​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/http-request-response.png"}`);
//? ✴️ HyperText Transfer Protocol (протокол передачі гіпертексту) 
//? - широко розповсюджений протокол для передачі веб-ресурсів різних типів: 
//? html, css, javascript, зображень, аудіо та відео тощо.
console.log(
    `%c
    HyperText Transfer Protocol
    (протокол передачі гіпертексту)
    - широко розповсюджений протокол для передачі
    веб-ресурсів різних типів:
    html, css, javascript, зображень, аудіо та відео тощо.
    `,
    'color: blue; font-size: 18px',
);
//? ✴️ HTTP ґрунтується на структурі клієнт-сервер 
//? і моделі запит-відповідь, в якій 
//? клієнтський застосунок ініціює з'єднання, 
//? формує запит і відправляє його на сервер, 
//? після чого сервер обробляє цей запит, 
//? формує відповідь і передає її назад клієнтові. 
//? Зв'язок між ними здійснюється за допомогою 
//? низки перемежованих HTTP-запитів і HTTP-відповідей.
console.log("-----------------------------------------------------------------------------------------");


//! Етапи обміну даними за протоколом HTTP
console.warn("Етапи обміну даними за протоколом HTTP:");
//? ✴️ HTTP​​-запит відбувається у кілька етапів:
console.log(
    `%c
    🔸 DNS-запит — пошук найближчого DNS-сервера,
       щоб перетворити адресу (наприклад google.com)
       в її числове вираження, IP-адресу (74.125.87.99).

    🔸 З'єднання — встановлення з'єднання
       сервером за отриманою IP-адресою.

    🔸 Передача даних — пересилання пакетів
       з клієнта на сервер.

    🔸 Очікування відповіді — очікування,
       доки пакети даних дійдуть до сервера,
       він їх обробить і відповідь повернеться назад.

    🔸 Отримання даних — пакети надійшли,
       можна отримувати з них дані.
    `,
    'color: blue; font-size: 18px',
);
console.log("-----------------------------------------------------------------------------------------");


//! Протокол HTTPS
console.warn(`Протокол HTTPS​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/http-vs-https.png"}`);
//? ✴️ HyperText Transfer Protocol Secure
//? — це налаштування над протоколом HTTP,
//? в якій всі повідомлення між клієнтом
//? і сервером шифруються з метою підвищення безпеки.
//? Забезпечує захист від атак, що базуються
//? на прослуховуванні з'єднання.
//? Дані передаються поверх криптографічних протоколів SSL або TLS.
console.log(
    `%c
    HyperText Transfer Protocol Secure
    - це налаштування над протоколом HTTP,
    в якій всі повідомлення між клієнтом
    і сервером шифруються з метою підвищення безпеки.
    `,
    'color: blue; font-size: 18px',
);
//? ✴️ Під час обміну через звичайне HTTP-з'єднання
//? всі дані передаються у вигляді тексту і можуть бути
//? прочитані усіма, хто отримав доступ до з'єднання
//? між клієнтом і сервером.
//? Якщо користувачі роблять покупки онлайн
//? і заповнюють форму замовлення, що містить інформацію
//? про кредитну картку, їхні фінансові дані набагато легше
//? викрасти, якщо вони передаються у вигляді тексту.
//? З HTTPS дані будуть зашифровані і хакер не зможе
//? їх розшифрувати, тому що для розшифрування необхідний
//? доступ до закритого ключа, який зберігається на сервері.

//? ✳️ Протокол HTTPS гарантує, що інформація про клієнта, 
//? наприклад номери кредитних карток, зашифрована 
//? і не може бути перехоплена в розшифрованому вигляді. 
//? Відвідувачі можуть переконатися, що сайт безпечний, 
//? подивившись на іконку зліва від адресного рядка, 
//? захищені з'єднання позначаються іконкою замка.
console.log("-----------------------------------------------------------------------------------------");
