console.log(
    '%c 2.REST API ',
    'color: white; background-color: #D33F49',
);

//! REST API
console.warn(`REST API​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/rest-api.png"}`);
console.warn("API простими словами. Що таке API: \n https://www.youtube.com/watch?v=vPVAYsc-U60");
console.warn("REST API простими словами. Що таке REST API: \n https://www.youtube.com/watch?v=EaFr0wYaxxM");
console.log(
    `%c
    API - інтерфейс або НАБІР ПРАВИЛ зв'язку
          між різними програмними компонентами.

    REST - СТИЛЬ бекенд-архітектури,
           для опису мережевих ресурсів.

    REST API - бекенд побудований за принципом REST.
    `,
    'color: blue; font-size: 18px',
);
//? ✴️ API (інтерфейс прикладного програмування)
//? - набір чітко визначених правил зв'язку
//? між різними програмними компонентами.
//? Інтерфейс описує, що можна попросити програму
//? зробити і що буде в результаті.

//? ✴️ REST (representational state transfer)
//? - стиль бекенд-архітектури, ґрунтується
//? на наборі принципів, які описують,
//? яким чином визначаються і адресуються мережеві ресурси.

//? ✴️ REST API - бекенд побудований за принципом REST.
//? Слугує прошарком між веб-застосунком і базою даних.
//? Має стандартний інтерфейс для звернення до ресурсів.
//? Працює як веб-сайт, ми посилаємо HTTP-запит з клієнта на сервер,
//? а у відповідь, замість HTML-сторінки, отримуємо дані в JSON-форматі.
console.log("-------------------------------------------------------------------------------");


//! Формат запиту
//? ✴️ REST-сервіс вимагає, щоб клієнт робив запит
//? на додавання, видалення або зміну даних.
//? Запит може складатися з наступних частин:
console.warn(`Формат запиту​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/request-format.png"}`);
console.log("-------------------------------------------------------------------------------");
