console.log(
    '%c 3.HTTP-методи.    \n   HTTP-заголовки. \n   Шляхи.          ',
    'color: white; background-color: #D33F49',
);

//! HTTP-методи 
console.warn(`HTTP-методи: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/http-methods.png"}`);

//? ✳️ Виділяють кілька основних HTTP-методів для роботи з REST-сервісом.

//?     📌 ---:
//? 🔸 ООО.
//? 🔸 ООО.
//? 🔸 ООО.


console.log(
    `%c
    <
        ......
    />
    `,
    'color: blue; font-size: 18px',
);

console.log("-------------------------------------------------------------------");

//! HTTP-методи. HTTP-заголовки. Шляхи. 
console.warn("HTTP-методи. HTTP-заголовки. Шляхи:");
console.warn(`Зображення​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/image-1.png"}`);
//? ✴️ Заголовки містять службову інформацію, що стосується контенту запиту. Наприклад, тип контенту, який клієнт може обробити у відповіді від сервера (заголовок Accept) або, який описує тип ресурсу, який клієнт відправляє серверу або сервер відправляє клієнту (заголовок Content-Type).


//! HTTP-методи. HTTP-заголовки. Шляхи. 
console.warn("HTTP-методи. HTTP-заголовки. Шляхи:");
console.warn(`Зображення​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_15/images/image-1.png"}`);