console.log(
    '%c 7.Цикл подій. ',
    'color: white; background-color: #D33F49',
);

//! Цикл подій
console.warn("Филипп Робертс: Что за чертовщина такая event loop?: \n https://www.youtube.com/watch?v=8aGhZQkoFbQ");
console.warn("Philip Roberts Help I'm stuck in an event loop: \n https://www.youtube.com/watch?v=6MXRNXXgP_0");
console.warn("Джейк Арчибальд. В цикле - JSConf.Asia: \n https://www.youtube.com/watch?v=cCOL7MC4Pl0");
console.warn("Иван Тулуп: асинхронщина в JS под капотом / Михаил Башуров (Luxoft): \n https://www.youtube.com/watch?v=bUx8wk4LdoY");
//? ✴️ Цикл подій є основою асинхронної моделі
//? програмуванняу браузері та середовищі Node.js.
//? Він дозволяє обробляти події, такі як клік мишею,
//? введення користувача чи завантаження сторінки,
//? у реактивний спосіб, реагуючи на них
//? за допомогою функцій-обробників.

//?     📌 Основні складові циклу подій:
//? 🔸 1.Очікування подій:
//?    Цикл подій очікує на події, які
//?    виникають у системі або браузері.
//?    Це можуть бути кліки мишею, натискання клавіші,
//?    завантаження сторінки, мережеві запити та багато іншого.
//? 🔸 2.Реєстрація обробників:
//?    Перед обробкою подій потрібно зареєструвати
//?    функції-обробники, які будуть викликані, 
//?    коли відповідні події стануть доступними. 
//?    Реєстрація відбувається шляхом прив'язки функції-обробника 
//?    до певного типу події або елемента, який генерує подію.
//? 🔸 3.Очікування та обробка подій: 
//?    Після реєстрації обробників цикл подій починає очікувати 
//?    на виникнення подій. Коли подія стає доступною, 
//?    викликаються відповідні функції-обробники, 
//?    які обробляють цю подію. Вони можуть виконувати певні дії, 
//?    змінювати стан програми або взаємодіяти з користувачем.
//? 🔸 4.Повторення циклу: 
//?    Після обробки поточної події цикл повертається 
//?    до очікування нових подій. Цикл подій продовжується доти, 
//?    поки є доступні події для обробки.
//? 🔸 5.Обробка винятків: 
//?    Під час обробки подій можуть виникати винятки або помилки. 
//?    Для забезпечення надійності та уникнення зупинки циклу подій, 
//?    важливо мати механізм обробки винятків. 
//?    Це можна зробити за допомогою конструкції try...catch, 
//?    яка дозволяє перехопити виняток і виконати 
//?    відповідні дії для відновлення або обробки помилки.

//? ✳️ Цикл подій забезпечує асинхронну та реактивну природу програм, 
//? дозволяючи взаємодіяти з користувачем, обробляти введення 
//? та виконувати дії відповідно до виникаючих подій. 
//? Він є важливою концепцією в багатьох програмних середовищах 
//? і використовується для створення різноманітних програм, 
//? від веб-додатків до серверних додатків.
console.log("----------------------------------------------------------------------");
