console.log(
    '%c 1.Поняття функції.            \n   Функціональний вираз.       \n   Виклик функції.             \n   Параметри та аргументи.     \n   Параметри за замовчуванням. \n   Оператор return.            ',
    'color: white; background-color: #D33F49',
);

//! Поняття функції
console.warn("Поняття функції: \n https://ruslan379.github.io/course-fe-html-css/lesson-FE3_09/images/function.png");
//? Функція - це підпрограма, незалежна частина коду,
//? призначена для багаторазового виконання конкретної задачі
//? з різними початковими значеннями.
//? Функції дозволяють структурувати великі програми,
//? зменшують повторення та ізолюють код.
//? Функцію можна уявити у вигляді чорного ящика:
//? вона отримує щось на вході(дані) і повертає щось
//? на виході(результат виконання коду всередині неї).
console.log("---------------------------------------");

//! Функціональний вираз (function expression)
console.warn("Функціональний вираз (function expression):");
//? Функціональний вираз(function expression) —
//? звичайне оголошення змінної, значення якої буде функція.
//? Має таку структуру:
//? - ключове слово const,
//? - ім'я функції — це дієслово,
//?   що відповідає на питання "Що зробити?"
//? - ключове слово function,
//? - пара круглих дужок(), в яких можуть бути параметри,
//? - тіло функції у фігурних дужках { }.
const add1 = function() {
    console.log("Це функція 'add1'");
};
console.log("add1:", add1);
console.log("---------------------------------------");



//! Виклик функції
console.warn("Виклик функції:");
//? Функція викликається за допомогою
//? імені та круглих дужок,
//? всередині яких можуть бути передані аргументи.
add1();
const result1 = add1();
console.log("result1:", result1);
console.log("---------------------------------------");


//! Параметри та аргументи. 
console.warn("Параметри та аргументи:");
//? В круглих дужках після імені функції зазначаються ПАРАМЕТРИ
//? - перелік даних, які функція очікує на момент виклику.
//? При виклику функції за допомогою імені та круглих дужок,
//? всередині цих дужок можуть бути передані АРГУМЕНТИ.
const add2 = function(a, b, c) {
    console.log("Це функція 'add2'");
    const sum = a + b + c;
    console.log("sum:", sum);
};

add2(1, 2, 3);
add2(10, 20, 30);
console.log("Виклик функції add2(1, 2, 3):", add2(1, 2, 3));
const result2 = add2(1, 2, 3);
console.log("result2:", result2);
console.log("---------------------------------------");


//! Параметри за замовчуванням. 
console.warn("Параметри за замовчуванням:");
//? Іноді необхідно оголосити функцію,
//? у параметрів якої будуть значення,
//? відмінні від undefined,
//? навіть якщо для них не передали аргументи. 
const add3 = function(a = 10, b = 20, c = 30) {
    console.log("Це функція 'add3'");
    const sum = a + b + c;
    console.log("sum:", sum);
};

add3(1, 2, 3);
console.log("Виклик функції add3(1, 2, 3):", add3(1, 2, 3));
const result31 = add3(1, 2, 3);
console.log("result31:", result31);
console.log(". . . . . . . . . . . . . . . . . . . .");

add3();
console.log("Виклик функції add3():", add3());
const result32 = add3();
console.log("result32:", result32);
console.log("---------------------------------------");


//! Оператор return. 
console.warn("Оператор return:");
//? Оператор return визначає значення, що повертається.
//? Коли інтерпретатор доходить до return,
//? він відразу ж виходить з функції,
//? і повертає це значення в те місце коду,
//? де функція була викликана.
const add4 = function(a, b, c) {
    console.log("Це функція 'add4'");
    const sum = a + b + c;
    console.log("sum:", sum);
    return sum;
    // return a + b + c;
};

add4(1, 2, 3);
console.log("Виклик функції add4(1, 2, 3):", add4(1, 2, 3));
const result4 = add4(1, 2, 3);
console.log("result4:", result4);
console.log("---------------------------------------");
