console.log(
    '%c 6.Область видимості.         \n   Область видимості функції. \n   Стек викликів.             ',
    'color: white; background-color: #D33F49',
);

//! Область видимості
console.warn("Область видимості:");
//? 

console.log("-----------------------------------------------------------");


//! Область видимості функції
console.warn("Область видимості функції:");
//? 

console.log("-----------------------------------------------------------");


//! Область видимості
console.warn("Стек викликів:");
//? 

console.log("-----------------------------------------------------------");
