console.log(
    '%c 1.Правила визначення this. ',
    'color: white; background-color: #D33F49',
);

//! Контекст виконання функції
console.warn("Контекст виконання функції:");
//? ✴️ Можна з упевненістю сказати, що ключове слово this
//? - це одна з найзаплутаніших концепцій JavaScript на старті навчання.
//? Новачки часто підставляють this методом наукового тику доти,
//? доки скрипт не спрацює.
//? ✳️ Контекст у JavaScript схожий на контекст у реченні:
//? 🔸 Петя біжить швидко, тому що ❗️Петя❗️ намагається зловити поїзд.
//? 🔸 Петя біжить швидко, тому що ✅він✅ намагається зловити поїзд.
//? ✳️ Друге речення звучить лаконічніше. 
//? Підмет речення - Петя, і ми можемо сказати, 
//? що контекст речення - це Петя, 
//? тому що він у центрі уваги у цей конкретний час у реченні. 
//? Навіть займенник «хто» стосується Петі.

//? ✳️ І так само об'єкт може бути поточним контекстом виконання функції.
console.log(
    `%c
    🔴 Петя біжить швидко, тому що ❗️Петя❗️ намагається зловити поїзд.
    `,
    'color: blue; font-size: 16px',
);

const petya1 = {
    username: "Petya",
    showName() {
        console.log(petya1.username);
    },
};
petya1.showName();
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//? ✳️ Звернення до властивостей об'єкта
//? всередині методів, використовуючи ім'я самого об'єкта,
//? - аналогічно використанню Петя, замість він.
//? ✳️ Всередині функцій можна використовувати 
//? зарезервоване ключове слово this.
//? Під час виконання функції, в this записується 
//? посилання на об'єкт, в контексті якого вона була викликана. 
//? Таким чином, в тілі функції ми можемо отримати доступ 
//? до властивостей і методів цього об'єкта.
console.log(
    `%c
    🟢 Петя біжить швидко, тому що ✅він✅ намагається зловити поїзд.
    `,
    'color: blue; font-size: 16px',
);

const petya2 = {
    username: "Petya",
    showName() {
        console.log(this.username);
    },
};
petya2.showName();
console.log("---------------------------------------------------------------------------------------------");


//! Правила визначення this
console.warn("❗️Правила визначення this❗️:");
//? ✴️ Правило для визначення this
//? - значення контексту всередині функції (не стрілочної)
//? визначається на момент її виклику,
//? а не на момент її створення.
//? Тобто значення this визначається тим,
//? як викликається функція,
//? а не де вона була оголошена.
console.log(
    `%c
    Значення this визначається тим,
    як викликається функція,
    а не де вона була оголошена.
    `,
    'color: red; font-size: 16px',
);

//! this у глобальній області видимості
console.warn("this у глобальній області видимості:");
//? ✴️ У глобальній області видимості,
//? якщо скрипт виконується не в суворому режимі,
//? this посилається на об'єкт ❗️window❗️.
//? В суворому режимі значення this,
//? в глобальній області видимості, буде ❗️undefined❗️.
function foo() {
    console.log("this in function foo():", this);
};
foo(); //! window без "use strict" або undefined з "use strict"
console.log("---------------------------------------------------------------------------------------------");


//! this в методі об'єкта
console.warn("this в методі об'єкта:");
//? ✴️ Якщо функція була викликана як метод об'єкта, 
//? то контекст буде посилатися на об'єкт, 
//? частиною якого є метод.
const petya = {
    username: "Petya",
    showThis() {
        console.log(this);
    },
    showName() {
        console.log(this.username);
    },
};

petya.showThis(); //! {username: "Petya", showThis: ƒ, showName: ƒ}
petya.showName(); //! 'Petya'
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


console.warn("Приклад визначення this в методі об'єкта:");
//? ✴️ Розглянемо складніший приклад для
//? кращого розуміння визначення this.
//? 🔸 Спочатку створимо функцію в глобальній області видимості і викличемо її.
//? 🔸 Після чого, присвоїмо її у властивість об'єкта і викличемо як метод цього об'єкта.
function showThis() {
    console.log("this in showThis: ", this);
};
//todo: Викликаємо у глобальному контексті:
showThis(); //! this in showThis: undefined або Window
console.log("`  `  `  `  `  `  `  `  `  `  `");

//todo: Створюємо об'єкт user1:
const user1 = {
    username: "Mango",
};
console.log("user1:", user1); //! {username: 'Mango'}
console.log("`  `  `  `  `  `  `  `  `  `  `");

//todo: Записуємо посилання на функцію у властивість об'єкта
//todo: Зверніть увагу, що це не виклик - немає ():
user1.showContext = showThis;
console.log("user1:", user1); //! {username: 'Mango', showContext: ƒ}
console.log("`  `  `  `  `  `  `  `  `  `  `");

//todo: Викликаємо функцію в контексті об'єкта
//todo: this буде вказувати на поточний об'єкт, в контексті
//todo: якого здійснюється виклик, а не на глобальний об'єкт.
user1.showContext(); //! this in showThis: {username: "Mango", showContext: ƒ}
console.log("---------------------------------------------------------------------------------------------");


//! Приклад визначення this в об'єкті всередині функції (не стрілочної)
console.warn("Приклад визначення this в об'єкті всередині функції (не стрілочної):");
//todo: Створюємо об'єкт user2:
const user2 = {
    username: "Mango",
    showThis2() {
        console.log("this in showThis2: ", this);
        console.log("username in showThis2: ", this.username);
        console.log("`  `  `  `  `  `  `  `  `  `  `");

        function foo() {
            console.log("this in function foo():", this);
            // console.log("username in in function foo(): ", this.username); //! ❌ Cannot read properties of undefined (reading 'username')
            console.log("username in in function foo(): ", user2.username); //! ✅ Mango
        };
        foo(); //! window без "use strict" або undefined з "use strict"
    },
};
console.log("user2:", user2); //! {username: 'Mango', showThis2: ƒ}
console.log("`  `  `  `  `  `  `  `  `  `  `");

user2.showThis2();
//! this in showThis: {username: 'Mango', showThis2: ƒ}
//! username in showThis2: Mango
//! `  `  `  `  `  `  `  `  `  `  `
//! this in foo: undefined
//! ❌ Cannot read properties of undefined (reading 'username') або ✅ Mango
console.log("---------------------------------------------------------------------------------------------");




console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("---------------------------------------------------------------------------------------------");
