console.log(
    '%c 4.Прототипне наслідування.. ',
    'color: white; background-color: #D33F49',
);

//! 4.Прототипне наслідування.
console.warn(`Прототипне наслідування: \n ${(window.location.href.split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_08/lesson-FE3_08.html"}`);
console.log(
    `%c
    прихована властивість [[Prototype]]
    у консолі браузера відображається як __proto__
    `,
    'color: blue; font-size: 18px',
);
//? ✴️ ООП в JavaScript побудовано на прототипному наслідуванні.
//? Об'єкти можна організувати у ланцюжки таким чином,
//? щоб здійснювався автоматичний пошук властивості в іншому об'єкті,
//? не знайденої в одному об'єкті.
//? Сполучною ланкою виступає
//? спеціальна прихована властивість [[Prototype]],
//? яка в консолі браузера відображається як __proto__.


//! Прототип (предок) об'єкта: методи Object.create() і isPrototypeOf(dog)
console.warn("Прототип (предок) об'єкта: методи Object.create() і isPrototypeOf(dog):");
//? ✴️ Метод Object.create() створює копію
//? старого об'єкту (прототипа або предока)
//? і повертає новий об'єкт, зв'язуючи його зі старим об'єктом.
//? ✳️ Метод Object.create(animal) створює і повертає новий об'єкт,
//? зв'язуючи його з об'єктом animal (прототипом або предоком).
const animal = {
    legs: 4,
};
console.log("animal:", animal); //! {legs: 4}

const dog = Object.create(animal);
dog.name = "Манго";

console.log("dog:", dog); //! {name: 'Манго', 🔻 [[Prototype]]: Object ▶️ legs:4}
console.log("animal.isPrototypeOf(dog):", animal.isPrototypeOf(dog)); //! true

//? ✴️ Об'єкт, на який вказує посилання в __proto__,
//? називається прототипом.
//? У нашому прикладі об'єкт animal
//? - це ❗️ПРОТОТИП❗️ (предок) для об'єкта dog.
//? ✴️ Метод ❗️isPrototypeOf()❗️ перевіряє,
//? чи є об'єкт animal прототипом для dog
//? і повертає true або false.
console.log("------------------------------------------------------------------------------");


//! Алгоритм роботи прототипа об'єкта
console.warn("Алгоритм роботи прототипа об'єкта:");
//? ✳️ Звернення dog.name працює очевидним чином 
//? - повертає власну властивість name об'єкта dog. 
console.log("dog.name:", dog.name); //! 'Манго'

//? ✳️ Звертаючись до dog.legs,
//? інтерпретатор шукає властивість legs в об'єкті dog,
//? не знаходить і продовжує пошук
//? в об'єкті за посиланням з dog.__ proto__,
//? тобто, у цьому випадку, в об'єкті animal - його прототипі.
console.log("dog.legs:", dog.legs); //! 4

//? ✴️ Тобто, прототип
//? - це резервне сховище властивостей і методів об'єкта,
//? автоматично використовується під час їх пошуку.
//? Об'єкт, який виступає прототипом,
//? може також мати свій прототип,
//? наступний - свій, і так далі.
//? Пошук властивості виконується до першого збігу.
//? Інтерпретатор шукає властивість за ім'ям в об'єкті,
//? якщо не знаходить,
//? то звертається до властивості __proto__,
//? тобто переходить за посиланням до об'єкта-прототипу,
//? а потім - до прототипу прототипу.
//? Якщо інтерпретатор дійде до кінця ланцюжка
//? і не знайде властивості з таким ім'ям, то поверне undefined.

//? ✳️⚠️ У специфікації властивість __proto__
//? позначена як [[Prototype]].
//? У цьому випадку важливі подвійні квадратні дужки,
//? вони вказують на те, що це внутрішня, службова властивість.
console.log("------------------------------------------------------------------------------");


//! Метод hasOwnProperty()
console.warn("Метод hasOwnProperty():");
//? ✳️ Після того як ми дізналися
//? про спосіб пошуку властивостей об'єкта,
//? повинно бути зрозуміло,
//? чому цикл for...in не розрізняє
//? властивості об'єкта і його прототипу.
console.log("dog:", dog); //! {name: 'Манго', 🔻 [[Prototype]]: Object ▶️ legs:4}
console.log("`  `  `  `  `  `  `  `");
for (const key in dog) {
    console.log(`${key}: ${dog[key]}`);
};
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . ."); 


//? ✴️❗️ Саме тому ми використовуємо 
//? метод obj.hasOwnProperty(prop), 
//? який повертає true, 
//? якщо властивість prop належить об'єкту obj, 
//? а не його прототипу, 
//? інакше - false.
//? ✴️✅ Повертає true тільки для власних властивостей:
console.log('dog.hasOwnProperty("name"):', dog.hasOwnProperty("name")); //! true
console.log('dog.hasOwnProperty("legs"):', dog.hasOwnProperty("legs")); //! false
console.log("`  `  `  `  `  `  `  `  `  `  `  `");

//? ✴️✅✅ Повертаємо true тільки для власних властивостей
//? за допомогою Цикла for...in:
for (const key in dog) {
    //todo: Якщо це власна властивість - виконуємо тіло if
    if (dog.hasOwnProperty(key)) {
        console.log(`${key}: ${dog[key]}`); //! name: Манго
    };
    //todo: Якщо це невласна властивість - нічого не робимо
};
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//? ✴️✅✅✅ Метод Object.keys(obj) також
//? поверне масив тільки ❗️ВЛАСНИХ❗️ ключів об'єкта obj,
//? тому, на практиці використовують саме його, а не for...in.
const dogKeys = Object.keys(dog);

console.log("dogKeys:", dogKeys); //! ['name']
console.log("------------------------------------------------------------------------------");
