console.log(
    '%c 5.Класи:            \n   Оголошення класу  \n   Екземпляр класу   \n   Конструктор класу \n   Об\'єкт параметрів \n   Методи класу      ',
    'color: white; background-color: #D33F49',
);

//! 5.Класи
console.warn("Класи:");
//? ✴️ Синтаксис літерала об'єкта дозволяє створити один об'єкт. 
//? Проте, часто потрібно створити багато однотипних об'єктів 
//? з однаковим набором властивостей, 
//? але різними значеннями і методами для взаємодії з ними. 
//? Все це потрібно робити динамічно, під час виконання програми. 
//? З цією метою використовують КЛАСИ 
//? - спеціальний синтаксис оголошення функції для створення об'єктів.
//? 🔸 
//? ✳️ 
console.log(
    `%c
    КЛАСИ - спеціальний синтаксис
    оголошення функції
    для створення об'єктів.
    `,
    'color: blue; font-size: 18px',
);
console.log("---------------------------------------------------");



//! Оголошення класу
console.warn("Оголошення класу:");
//? ✴️ Оголошення класу починається з ключового слова class, 
//? після якого стоїть ім'я класу і фігурні дужки - його тіло. 
//? Класи прийнято називати з великої літери, 
//? а у назві відображати тип об'єкта (іменника), що створюється.
class User {
    //todo: Тіло класу
};
console.log("User:", User); //! {}
console.log("---------------------------------------------------");

//! Екземпляр класу
console.warn("Екземпляр класу:");
//? ✴️ Результат виклику new User() 
//? - це об'єкт, який називається екземпляром класу, 
//? тому що містить дані і поведінку, що описуються класом.
const mango = new User();
console.log("mango:", mango); //! {}

const poly = new User();
console.log("poly:", poly); //! {}
console.log("---------------------------------------------------");


//! Конструктор класу
console.warn("Конструктор класу:");
//? ✴️ Для ініціалізації екземпляра в класі є метод constructor. 
//? Якщо він неоголошений, створюється конструктор за замовчуванням 
//? - порожня функція, яка не змінює екземпляр.
class User1 {
    //todo:  Синтаксис оголошення методу класу:
    constructor(name, email) {
        //todo: Ініціалізація властивостей екземпляра:
        this.name = name;
        this.email = email;
    };
};

const mango1 = new User1("Манго", "mango@mail.com");
console.log("mango1:", mango1); //! User1 {name: 'Манго', email: 'mango@mail.com'}

const poly1 = new User1("Поли", "poly@mail.com");
console.log("poly1:", poly1); //! User1 {name: 'Поли', email: 'poly@mail.com'}
console.log("---------------------------------------------------");











// console.log("total:", total); //! 32
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("---------------------------------------------------");
