console.log(
    '%c 7.Наслідування класів:         \n   Конструктор дочірнього класу \n   Методи дочірнього класу      ',
    'color: white; background-color: #D33F49',
);

//! 7.
console.warn(":");
//? ✴️ 
//? 🔸 
//? ✳️ 
console.log(
    `%c
    приклад
    `,
    'color: blue; font-size: 18px',
);

// console.log("total:", total); //! 32
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("-------------------------------------------------------------");
