console.log(
    '%c 3.Частота спрацьовування лічильника. ',
    'color: white; background-color: #D33F49',
);

//! 3.Частота спрацьовування лічильника.
//? ✴️ У браузерного таймера є мінімально можлива затримка.
//? У сучасних браузерах вона коливається приблизно
//? від 0 до 4 мілісекунд.
//? У старіших браузерах затримка може бути більшою
//? і досягати 15 мілісекунд.
//? За стандартом, мінімальна затримка становить
//? 4 мілісекунди, тому різниці між
//? setTimeout(callback, 1) і setTimeout(callback, 4) немає.

//? ✳️ Таймер може спрацьовувати рідше, 
//? ніж зазначено в параметрі delay, 
//? тому що за надто великого завантаження процесора 
//? деякі запуски функцій-інтервалів будуть пропущені. 
//? Браузери продовжують виконувати тайм-аути та інтервали, 
//? навіть якщо вкладка браузера неактивна, 
//? але водночас знижують частоту спрацьовування таймерів.

console.log(
    `%c
    За стандартом, мінімальна затримка
    становить 4 мілісекунди,
    тому різниці між setTimeout(callback, 1)
    і setTimeout(callback, 4) немає.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");
