console.log(
    '%c 1.Деструкткризація об\'єктів. ',
    'color: white; background-color: #D33F49',
);

//! Деструкткризація об'єктів
console.warn("Деструкткризація об'єктів:");
//? ✳️ 

//? ✴️ 

// console.log("object:", object);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("--------------------------------------------------------------------------------------------------");
