console.log(
    '%c 2.Деструкткризація масивів. ',
    'color: white; background-color: #D33F49',
);

//! Деструкткризація масивів
console.warn("Деструкткризація масивів:");
//? ✳️ 

//? ✴️ 

// console.log("object:", object);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("--------------------------------------------------------------------------------------------------");
