console.log(
    '%c 3.Патерн \«Об\'єкт параметрів\». ',
    'color: white; background-color: #D33F49',
);

//! Патерн «Об'єкт параметрів»
console.warn("Патерн «Об'єкт параметрів»:");
//? ✳️ 

//? ✴️ 

// console.log("object:", object);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("--------------------------------------------------------------------------------------------------");
