console.log(
    '%c 4.Делегування подій ',
    'color: white; background-color: #D33F49',
);

//! Делегування подій​
console.warn(`Делегування подій (до)​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_01/images/before-delegation.webp"}`);
//? ✴️ Спливання дозволяє реалізувати
//? один із найкорисніших прийомів - делегування подій (event delegation).
//? Він полягає у тому, що, якщо є група елементів,
//? події яких потрібно обробляти однаково,
//? то додається один обробник на їх загального предка,
//? замість того, щоб додавати обробник до кожного елемента.
//? Використовуючи властивість event.target,
//? можна отримати посилання на цільовий елемент,
//? зрозуміти, на якому саме дочірньому елементі відбулася подія, і обробити її.

//? ✳️ Розглянемо приклад-1 "Активний елемент" з попереднього розділу.
//? Але тепер уявімо, що кількість дочірніх елементів (кнопок) дорівнює 100.
//? Тоді з'явилася б необхідність додати слухача на кожен активний елемент.
//? Проблема у тому, що у нас є 100 слухачів подій.
//? Всі вони вказують на одну і ту саму функцію слухача, але слухачів 100.
//? Таке рішення значно збільшило б кількість коду та знизило його читабельність.

//? ✳️ Для вирішення цього завдання перемістимо
//? усіх слухачів на спільного предка - елемент <div id="buttons-box>:
console.warn(`Делегування подій (після)​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_01/images/after-delegation.png"}`);

//? ✳️ Тепер є тільки один обробник події кліку і браузеру
//? не потрібно зберігати у пам'яті сто різних слухачів.
//? Тобто делегування зводиться до трьох простих кроків:
//? 🔸1️⃣ Визначити спільного предка групи елементів для відстеження подій.
//? 🔸2️⃣ Зареєструвати на елементі-предку обробник події,
//?    яку ми хочемо відловлювати з групи елементів.
//? 🔸3️⃣ В обробнику використовувати event.target для вибору цільового елемента.
//? ✳️ Такий підхід спрощує ініціалізацію слухачів однотипних елементів. 
//? Можна додавати, видаляти або змінювати елементи, при цьому, 
//? не потрібно вручну додавати або видаляти обробники подій.
console.log("--------------------------------------------------------------------");

//! Активний елемент (приклад-2 (після))​
console.warn("Активний елемент (приклад-2 (після))​​​:");
const buttonBox = document.querySelector(".part_4 #buttons-box");

console.log("Buttons box:", buttonBox);

buttonBox.addEventListener("click", (event) => {
    event.target.classList.toggle("active");
    console.log("event.target.tagName = ", event.target.tagName);
    // console.log(`Клік в ${event.target.textContent}`);

    switch (event.target.tagName) {
        case "DIV":
            console.log(`Клік в ${event.target.tagName} - Buttons box`);
            break;
        case "BUTTON":
            console.log(`Клік в ${event.target.textContent}`);
            break;
        default:
            console.warn("НЕ спрацював ЖОДЕН блок!"); //! інструкції default блока;
    };
    console.log(". . . . . . . . . . . . . . . . .");

});
console.log("--------------------------------------------------------------------");
