console.log(
    '%c 4.Debounce (відкладений виклик) ',
    'color: white; background-color: #D33F49',
);

//! Debounce (відкладений виклик)
console.warn(`Debounce: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_02/images/debounce.png"}`);

//? ✴️ Прийом debounce гарантує, 
//? що функція буде викликана лише у тому разі, 
//? якщо між подіями буде пауза N мілісекунд. 
//? Наприклад, доки користувач скролить сторінку 
//? функція не буде викликана, 
//? але щойно він перестав скролити, 
//? функція буде викликана через 300 мілісекунд. 
//? Якщо скрол відновиться раніше, 
//? ніж через 300 мілісекунд після паузи, 
//? функція не буде викликана.
//? ✳️ 
//? 🔸 
//? 🔸 ❗️❗️ 

console.log("-----------------------------------------------------------");
