console.warn('9.Запитання');

//? У якому атрибуті тега script вказується шлях до файлу скрипта?

//? Яка директива активує суворий режим?

//? Який метод використовується для виведення інформації
//?  з коду в консоль інструментів розробника?

//? Якої помилки припустилися в цьому фрагменті коду
//?  під час оголошення змінної: username = "Jacob Mercer"; ?

//? За допомогою якого ключового слова оголошується змінна, 
//? якій не можна задати нове значення після її оголошення?

//? Що буде виведено в консоль інструментів розробника?
let username;
// console.log('username:', username);

//? Яким буде результат виразу typeof "true"?
