console.log(
    '%c 1.Створення об\'єкта.      \n   Доступ до властивостей. \n   Видалення властивостей. ',
    'color: white; background-color: #D33F49',
);

//! Визначення об'єкта
//? Об'єкти дозволяють описати і згрупувати
//? характеристики певної сутності
//? - користувача, книги, продукту в магазині,
//? чого завгодно.
//? Об'єкти ще називають словниками, тобто
//? вони містять терміни (імена властивості або ключі)
//? та їх визначення (значення).


//! Створення об'єкта
console.warn("Створення об'єкта:");
//? Для оголошення використовуються фігурні дужки {} - літерал об'єкта.

//? Під час створення об'єкта можна додати властивості, 
//? кожна з яких описується параметрами -  ключ: значення. 
//? КЛЮЧ ще називають ІМ'ЯМ властивості і це завжди рядок. 
//? ЗНАЧЕННЯМ властивості можуть бути будь-які типи: 
//? примітиви, масиви, об'єкти, булі, функції тощо. 
//? Властивості розділяються комою.
const book = {
    title: "The Last Kingdom",
    author: "Bernard Cornwell",
    genres: ["historical prose", "adventure"],
    isPublic: true,
    rating: 8.38,
};
console.log("book:", book); //! true
console.log("---------------------------------------------------------------------------");




//? Приклади:
//todo: isInfant() — «чи це немовля?»
