console.log(
    '%c 1.Модульність коду. Збірка модулів ',
    'color: white; background-color: #D33F49',
);

//! Модульність коду
console.warn("Модульність коду:");
//? ✴️ Модульний код допомагає в організації, обслуговуванні,
//? тестуванні й, саме головне, управлінні залежностями.
//? Найбільш важливі переваги модулів це підтримувані,
//? простір імен і повторне використання.
//?    📌
//? 🔸 Підтримування — добре розроблений модуль покликаний
//?    максимально знизити залежність від інших частин коду.
//?    Це дозволить розширювати функціонал додатка не побоюючись
//?    порушити його роботу в цілому. Оновлення одного модуля
//?    набагато простіше, якщо модуль самодостатній.
//? 🔸 Простір імен — змінні, що не входять в зону видимості функції,
//?    є глобальними. Через це зазвичай відбувається забруднення простору імен,
//?    де повністю непов'язаний код розділяє глобальні змінні.
//?    Модулі дозволяють уникнути забруднення простору імен,
//?    створюючи окрему область видимості для змінних.
//? 🔸 Повторне використання — всі розробники копіювали готовий код
//?    в нові проєкти, змінюючи його під специфіку проєкту.
//?    Це, очевидно, величезна трата часу. Набагато краще коли є модуль,
//?    який можна повторно використовувати знову і знову без необхідності
//?    знати що-небудь про оточення в якому він використовується.
console.log(
    `%c
    Модульний код допомагає в організації, обслуговуванні,
    тестуванні й, саме головне, управлінні залежностями.

    Найбільш важливі переваги модулів це:
    🔸 Підтримування
    🔸 Простір імен
    🔸 Повторне використання
    `,
    'color: blue; font-size: 18px',
);
console.log("------------------------------------------------------------------------------------------");


//! Збірка модулів
console.warn("Збірка модулів:");
//? ✴️ Збірка модулів — це процес конкатенації групи модулів,
//? і їх залежностей, в один або групу файлів.
console.log(
    `%c
    Збірка модулів — це процес конкатенації групи модулів,
    і їх залежностей, в один або групу файлів.
    `,
    'color: blue; font-size: 18px',
);
//? ✳️ Зазвичай код ділять на папки і файли, до того ж необхідно
//? підключити зовнішні бібліотеки. В результаті, кожен з цих файлів
//? потрібно включити в основний HTML-файл в тезі script,
//? який потім завантажується браузером.
//? ✳️ Наявність окремих тегів script для кожного файлу означає,
//? що браузер буде завантажувати кожен файл окремо,
//? що негативно позначається на швидкості завантаження сторінки
//? (HTTP / 2 трохи допомагає з розв'язання цієї проблеми).
//? Щоб обійти цю проблему, файли об'єднуються в один або пару файлів,
//? щоб зменшити кількість запитів. Але залишається проблема управління
//? залежностями між модулями.
//? ✳️ Якщо використовуються системи модулів які браузери не підтримують, 
//? такі як CommonJS або ESM, необхідно використовувати інструмент 
//? для їх перетворення в правильно впорядкований, доступний браузеру код. 
//? Саме тут вступають в дію Webpack, Parcel і інші бандлери (від англійського bundle).
console.log("------------------------------------------------------------------------------------------");
