console.log(
    '%c 1.Відкладене завантаження ',
    'color: white; background-color: #D33F49',
);

//todo: Додаткова логіка для <Урок-FE4-JS-02 -> Розділ.1>
const button1 = document.querySelector('.button-1');
const boxPart1 = document.querySelector('.part_1 .box');
// console.log("button1:", button1); //!
// console.log("boxPart1:", boxPart1); //!

if (button1.textContent === 'On') {
    boxPart1.style.display = 'block';
};
//todo: _________________________________________________

//! Відкладене завантаження («above the fold» і «below the fold»)
console.warn(`Відкладене завантаження («above the fold» і «below the fold»)​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_03/images/page-fold.png"}`);
//? ✴️ Веб-сторінки містять велику кількість зображень,
//? які збільшують розмір сторінок і впливають на швидкість їх завантаження.
//? Більшість зображень знаходяться за межами першого екрану
//? (за кадром, below the fold), тому користувач побачить їх
//? тільки після прокручування сторінки. Це означає, що ви,
//? можливо, завантажуєте те, що користувач ніколи не побачить,
//? але витратить на це час і, можливо, гроші.
//? Завантаження некритичного контенту також
//? розряджає акумулятор мобільних пристроїв
//? та витрачає інші системні ресурси.
//? ✳️ Терміни «above the fold» (в кадрі або вище за згин)
//? і «below the fold» (за кадром або нижче за згин)
//? прийшли з часів до появи цифрових технологій.
//? Якщо ви коли-небудь купували газету в кіоску, їх, як правило,
//? складають навпіл, щоб перехожі могли бачити
//? тільки верхню половину першої сторінки.
//? Якщо їм не сподобається те, що вони побачать,
//? вони пройдуть повз, і продажі впадуть.
//? Ось чому так важливо розміщати найбільш цікавий контент
//? у верхній частині сторінки.


//! Відкладене завантаження (lazy-loading)
console.warn("Відкладене завантаження (lazy-loading):");
//? ✴️ Відкладене завантаження (lazy-loading)
//? - це прийом, який відкладає завантаження
//? некритичних ресурсів під час завантаження сторінки.
//? Замість цього, ці некритичні ресурси завантажуються
//? лише у разі потреби.
//? Це знижує початкову вагу ресурсів,
//? які необхідно завантажити для відображення сторінки,
//? використання системних ресурсів
//? підвищує час її завантаження та наступного рендеру.
//? Все це позитивно позначається на продуктивності.
//?     📍 На на практиці ледаче завантаження виглядає приблизно так:
//? 🔸 Ви потрапляєте на сторінку і починаєте прокручувати її, читаючи вміст.
//? 🔸 У якийсь момент ви прокручуєте сторінку до зображення - заглушки.
//? 🔸 Зображення - заглушка раптово змінюється на справжнє зображення.


//! Атрибут loading
//? ✴️ Сучасні браузери вміють робити це
//? без JavaScript, але, на жаль, не всі.
//? HTML-атрибут loading тегу <img> підтримується нативно
//? у всіх сучасних браузерах, крім, можливо, Safari,
//? і дозволяє браузеру відкласти завантаження зображень
//? за кадром доти, доки користувач не прокрутить до них сторінку.
//?     📍 Підтримує три значення:
//? 🔸 lazy - браузер виконає відкладене завантаження зображення.
//? 🔸 eager - зображення буде завантажене за першої нагоди,
//?    тобто без відкладеного завантаження.
//? 🔸 auto (значення за замовчуванням) - браузер сам визначає
//?    чи виконувати відкладене завантаження чи ні.
console.log(
    `%c
    <img
        src="./my-image.jpg"
        alt="Image description"
        loading="lazy"
    />
    `,
    'color: blue; font-size: 18px',
);
//? ✳️ У вкладці Network в інструментах розробника
//? виберіть фільтр Img, щоб відображалось лише завантаження зображень.
//? Після цього прокручуйте приклад і спостерігайте
//? як будуть довантажуватися закадрові зображення котів.
//? Браузери, що підтримують атрибут loading,
//? будуть завантажувати зображення відкладено,
//? а браузери без підтримки - завантажать усі зображення відразу.
console.log("-------------------------------------------------------------------");
