console.log(
    '%c 3.Відкладене завантаження (з концепцією Intersection Observer) ',
    'color: white; background-color: #D33F49',
);

//! Відкладене завантаження (з концепцією Intersection Observer)
console.warn("Відкладене завантаження (з концепцією Intersection Observer)​:");
//? ✴️ 
//? ✳️ 

//! Throttle (обмежувач частоти)
// console.warn(`Throttle​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_02/images/throttle.png"}`);
//? ❗️❗️❗️ 

//? 📍 Використання Throttle:
//? 🔸 Обробка подій прокручування.
//? 🔸 Відстеження переміщення миші.
//? 🔸 Обмеження частоти натискань.

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("-----------------------------------------------------------------");