console.log(
    '%c 2.Події миші​:                     \n   Типи подій миші.​                \n   Порядок подій.                  \n   Кнопка миші.​                    \n   Координати: clientX/Y, pageX/Y. \n   Прокрутка.​                      ',
    'color: white; background-color: #D33F49',
);

//! Події миші
console.warn("Події миші: \n https://uk.javascript.info/event-details");
//? ✴️ У цьому розділі ми докладніше розглянемо
//? події миші та їх властивості.
//? ✴️ Зверніть увагу: 
//? подібні події можуть надходити не тільки від миші, 
//? але й з інших пристроїв, 
//? таких як телефони та планшети, 
//? де вони емулюються для сумісності.
console.log("--------------------------------------------------------------");


//! Типи подій миші
console.warn("Типи подій миші:");
//? ✴️ Ми вже бачили деякі з цих подій:
//? 🔸 mousedown/mouseup - клікання/відпускання кнопки миші над елементом.
//? 🔸 mouseover/mouseout - курсор заходить/виходить з елемента.
//? 🔸 mousemove - кожне переміщення миші над елементом викликає цю подію.
//? 🔸 click - спрацьовує після mousedown, а потім mouseup над тим же елементом,
//?    якщо була використана ліва кнопка миші.
//? 🔸 dblclick - спрацьовує після двох кліків на одному елементі за короткий проміжок часу.
//?    На сьогоднішній день рідко використовується.
//? 🔸 contextmenu - спрацьовує при натисканні правої кнопки миші.
//?    Є й інші способи відкрити контекстне меню, наприклад, 
//?    за допомогою спеціальної клавіші на клавіатурі, 
//?    але це вже не зовсім подія миші.
//? Також існують кілька інших подій, про них ми розповімо пізніше.
console.log(
    `%c
    🔸 mousedown/mouseup
    🔸 mouseover/mouseout
    🔸 mousemove
    🔸 click
    🔸 dblclick
    🔸 contextmenu
    `,
    'color: blue; font-size: 16px',
);
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
const myButton1 = document.querySelector(".my-button-1");
console.log("myButton1:", myButton1);

myButton1.addEventListener("contextmenu", clickRightButton);

function clickRightButton(event) {
    // console.log("event.target:", event.target);
    // console.log("event.currentTarget:", event.currentTarget);
    console.log("Клік правою кнопкою миші на <My button-1>");
};
console.log("--------------------------------------------------------------");


//! Порядок подій
console.warn("Порядок подій:");
//? ✴️ Як ви можете бачити зі списку вище,
//? дія користувача може викликати безліч подій.
//? ✳️ Наприклад, клік лівою кнопкою
//? спочатку ініціює mousedown, коли кнопку натиснуто,
//? потім mouseup і click, коли її відпускають.
//? ✳️ У випадках, коли одна дія ініціює декілька подій, 
//? їх порядок фіксується.
//? Тобто обробники викликаються в порядку: 
//? mousedown → mouseup → click.
console.log("--------------------------------------------------------------");


//! Кнопка миші
console.warn("Кнопка миші:");
//? ✴️ Події, пов’язані з кліками,
//? завжди мають властивість button,
//? що дозволяє отримати точну кнопку миші.
//? ✴️ Зазвичай ми не використовуємо її
//? для подій click і contextmenu,
//? оскільки перше відбувається лише
//? при натисканні лівою кнопкою миші,
//? а останнє – лише при натисканні правою кнопкою миші.
//? ✴️ З іншого боку, обробникам mousedown та mouseup
//? може знадобитися event.button,
//? тому що ці події запускаються на будь-якій кнопці,
//? тому button дозволяє розрізняти
//? “праву кнопку миші” та “ліву кнопку миші”.
console.log(
    `%c
    🔸 0 - ліва кнопка (основна)
    🔸 1 - середня кнопка (допоміжна)
    🔸 2 - права кнопка (другорядна)
    🔸 3 - кнопка X1 (назад)
    🔸 4 - кнопка X2 (вперед)
    `,
    'color: blue; font-size: 16px',
);
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
const myButton2 = document.querySelector(".my-button-2");
console.log("myButton2:", myButton2);

myButton2.addEventListener("mousedown", clickButton);

function clickButton(event) {
    console.log("Клік кнопкою миші на <My button-2>");
    console.log("event.button:", event.button);
    console.log(". . . . . . . . . . . . . . . . . .");
    
};
console.log("--------------------------------------------------------------");


//! Координати: clientX/Y, pageX/Y
console.warn("Координати: clientX/Y, pageX/Y:");
//? ✴️ Усі події миші надають координати у двох варіантах:
//? 🔸Відносно Window: clientX та clientY.
//? 🔸Відносно Document: pageX та pageY.