console.log(
    '%c 4.Патерн «Раннє повернення» (Guard Clause) ',
    'color: white; background-color: #D33F49',
);

//! 4.Патерн «Раннє повернення» (Guard Clause)
console.warn("Функція, яка обробляє зняття коштів за допомогою if...else:");
//? Створимо функцію, яка обробляє зняття коштів 
//? з особистого рахунку в банку. 
//? Вона отримує суму для зняття і поточний баланс рахунку,
//? після чого, залежно від умови, виконує необхідний блок коду.
const withdraw1 = function(amount, balance) {
    console.log("amount:", amount);
    console.log("balance:", balance);
    if (amount === 0) {
        console.log("0️⃣ Для проведення операції введіть суму більшу за нуль");
    } else if (amount > balance) {
        console.log("❌ Недостатньо коштів на рахунку");
    } else {
        console.log("✅ Операція зняття коштів проведена успішно");
    };
    console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
};

withdraw1(0, 300); //! "Для проведення операції введіть суму більшу за нуль"
withdraw1(500, 300); //! "Недостатньо коштів на рахунку"
withdraw1(100, 300); //! "Операція зняття коштів проведена успішно"
console.log("----------------------------------------------------------");


console.warn("Функція, яка обробляє зняття коштів \n  за допомогою патерну «Раннє повернення» :");
//todo: Патерн «Раннє повернення»
//? - це спосіб використовувати можливість
//? дострокового повернення з функції
//? за допомогою оператора return.
//? Використовуючи цей прийом, ми отримуємо чистіший,
//? плоскіший і зрозуміліший код, який простіше рефакторити.
const withdraw2 = function(amount, balance) {
    console.log("amount:", amount);
    console.log("balance:", balance);
    //todo:  Якщо умова виконується, викликається console.log
    //todo:  і вихід із функції. Код після тіла if не виконається.
    if (amount === 0) {
        console.log("0️⃣0️⃣ Для проведення операції введіть суму більшу за нуль");
        console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
        return;
    };
    //todo:  Якщо умова першого if не виконалась, його тіло пропускається
    //todo:  та інтерпретатор доходе до другого if.
    //todo:  Якщо умова виконується, викликається console.log і вихід із функції.
    //todo:  Код, що знаходиться після тіла if, не виконається.
    if (amount > balance) {
        console.log("❌❌ Недостатньо коштів на рахунку");
        console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
        return;
    };
    //todo:  Якщо жоден із попередніх if не виконався,
    //todo:  інтерпретатор доходить до цього коду і виконує його.
    console.log("✅✅ Операція зняття коштів проведена");
    console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
};

withdraw2(0, 300); //! "Для проведення операції введіть суму більшу за нуль"
withdraw2(500, 300); //! "Недостатньо коштів на рахунку"
withdraw2(100, 300); //! "Операція зняття коштів проведена"
console.log("----------------------------------------------------------");
