// console.log('10.Практика:');
console.log(
  "%c 10.Практика: ",
  "color: white; background-color: #D33F49",
);

//! ПРАКТИКА-10 (Урок-10_JS)
//todo [1]
console.log(
  "%c [1] ",
  "color: yellow; background-color: #2274A5",
);
//? Замінити в функції "Приготування меленої кави"
//? функцію "Приготування меленої кави" та
//? функцію "Приготування окропу (гарячої води)"
//? //? на стрілкові функції та використати їх як колбеки.
console.log("-----------------------------------------");


//todo [2]
console.log(
  "%c [2] ",
  "color: yellow; background-color: #2274A5",
);
//? Замінити в функції "Приготування меленої кави"
//? функцію "Приготування меленої кави" та
//? функцію "Приготування окропу (гарячої води)"
//? на анонімні стрілкові функції з неявним поверненням
//? та використати їх як колбеки.
console.log("-----------------------------------------");
