console.log(
    '%c 1.Що таке проміс? ',
    'color: white; background-color: #D33F49',
);

//! Що таке проміс
console.warn(`Інструкція «if...else»​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_13/images/if...else.jpg"}`);
console.warn(`Приклад з промісом (обіцянкою) ​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_13/images/promise.jpg"}`);
//? ✴️ Проміс (Promise) – це Обіцянка.
//? ✳️ Розглянемо приклад обіцянки із життя.
//? Сім'я відпочиває на природі.
//? Вранці Тато йде на рибалку та обіцяє повернутися з рибою.
//? Мама чекає на нього до обіду і приймає таке рішення:
//? якщо Тато принесе рибу – то на обід буде рибна юшка.
//? Якщо Тато повернеться без риби, на обід Мама приготує борщ.
//? Обід відбудеться у будь-якому випадку, після того як повернеться Тато.
//? Після того, як Тато відправився на рибалку,
//? сім'я перебуває в стані очікування
//? і при цьому продовжує відпочивати – купатися, засмагати, грати в ігри.


//! Стани промісу
console.warn(`Стани промісу​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_13/images/promise-states.png"}`);
//? ✴️ Promise (обіцянка, проміс) - об'єкт,
//? що представляє поточний стан асинхронної операції.
//? Це обгортка для значення, невідомого на момент створення промісу.
//? Дозволяє обробляти результати асинхронних операцій таким чином,
//? якби вони були синхронними: замість кінцевого результату
//? асинхронної операції, повертається своєрідна обіцянка
//? отримати результат у майбутньому.

//?     📌 Проміс може бути у трьох станах:
//? 🔸 Очікування (pending) - початковий стан під час створення промісу.
//? 🔸 Виконано (fulfilled) - операція виконана успішно з будь-яким результатом.
//? 🔸 Відхилено (rejected) - операція відхилена з помилкою.
console.log(
    `%c
        📌 Проміс може бути у трьох станах:
    🔸 Очікування (pending) - початковий стан під час створення промісу.
    🔸 Виконано (fulfilled) - операція виконана успішно з будь-яким результатом.
    🔸 Відхилено (rejected) - операція відхилена з помилкою.
    `,
    'color: blue; font-size: 18px',
);
//? ✴️ На момент створення проміс знаходиться в очікуванні (pending),
//? після чого може завершитися успішно (fulfilled),
//? повернувши результат (значення),
//? або з помилкою (rejected), повернувши причину.
//? Коли проміс переходить у стан fulfilled або rejected - це назавжди.

//?     📌 Відмінності промісу і callback-функці:
//? 🔸 Колбеки - це функції, обіцянки - це об'єкти.
//? 🔸 Колбеки передаються як аргументи з зовнішнього коду у внутрішній,
//?    а обіцянки повертаються з внутрішнього коду у зовнішній.
//? 🔸 Колбеки обробляють успішне або неуспішне завершення операції,
//?    обіцянки нічого не обробляють.
//? 🔸 Колбеки можуть обробляти декілька подій,
//?    обіцянки пов'язані тільки з однією подією.
console.log("--------------------------------------------------------------------------------------------------------------------------");
