console.log(
    '%c 1.Web Storage API. localStorage. ',
    'color: white; background-color: #D33F49',
);

//! Web Storage API
console.warn("Web Storage API:");
//? ✴️ Веб-сховище складається з локального сховища
//? (localStorage) і сховища сеансів (sessionStorage).
//? Забезпечує спосіб зберігання даних інтуїтивно
//? зрозумілим чином у вигляді пар ключ:значення.
//? Технічно у веб-сховище можна записати тільки рядки,
//?  але це не проблема, якщо використовувати
//?  методи класу JSON для перетворення складних типів.
//? У веб-сховище не записують методи об'єктів або функції, тільки дані.

//? ✳️ Локальне сховище (localStorage)
//? - унікальне для кожного веб-застосунку
//? і буде однаковим на декількох вкладках,
//? в яких він (веб-застосунок) запущений.
//? Дані в локальному сховищі не видаляються,
//? навіть після закриття браузера або
//? вимкнення комп'ютера.
//? Щоб їх видалити, необхідно використовувати JavaScript.

console.log(
    `%c
        Локальне сховище (localStorage)
    - унікальне для кожного веб-застосунку
    і буде однаковим на декількох вкладках,
    в яких він (веб-застосунок) запущений.
        Дані в локальному сховищі не видаляються,
    навіть після закриття браузера або
    вимкнення комп'ютера.
    Щоб їх видалити, необхідно використовувати JavaScript.
    `,
    'color: blue; font-size: 18px',
);

//? ✳️ Сховище сеансів (sessionStorage) схоже на локальне
//? - воно також унікальне для кожного веб-застосунку,
//? але час життя збережених даних обмежений сесією вкладки браузера.
//? Щойно користувач закриває вкладку або браузер, дані очищаються.
//? На практиці сховище сеансів використовується значно рідше.

//? ❗️❗️❗️ У веб-сховищі не зберігають паролі,
//? номери банківських карт і подібну
//? конфіденційну інформацію.
//? Якщо шкідливий скрипт отримає доступ до веб-сторінки,
//? він без проблем прочитає ці дані.
console.log("-------------------------------------------------------------------------------------------------");


//! localStorage
console.warn("localStorage:");
//? ✴️ Дозволяє зберігати дані без закінчення терміну дії
//? у форматі пар ключ:значення на комп'ютері користувача
//? і читати їх при повторному відвідуванні сторінки.
//? Локальне сховище і сховище сесії - це частина браузера,
//? тому вони доступні як властивості об'єкта window,
//? мають однаковий набір властивостей і методів,
//? і відрізняються тільки поведінкою.
//? 🔸 setItem(key, value) - створює новий, або оновлює вже існуючий запис у сховищі.
//? 🔸 getItem(key) - повертає зі сховища значення з ключем key.
//? 🔸 removeItem(key) - видаляє зі сховища запис з ключем key.
//? 🔸 clear() - повністю очищає всі записи сховища.
//? 🔸 length - кількість записів у сховищі.

console.log(
    `%c
    🔸 setItem(key, value) - створює новий,
       або оновлює вже існуючий запис у сховищі.
    🔸 getItem(key) - повертає зі сховища значення з ключем key.
    🔸 removeItem(key) - видаляє зі сховища запис з ключем key.
    🔸 clear() - повністю очищає всі записи сховища.
    🔸 length - кількість записів у сховищі.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------------------------------------");


//! Інтерфейс localStorage
console.warn(`Інтерфейс localStorage​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_09/images/interface-local-storage.jpg"}`);
