console.log(
    '%c 1.Метод reduce(). ',
    'color: white; background-color: #D33F49',
);

//! 1.Метод reduce()
console.warn("Синтаксис методу reduce():");
//? ✴️ Метод reduce(callback) .
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Не змінює оригінальний масив.
//? 🔸 Повертає новий масив.
//? 🔸 Додає у масив, що повертається, елементи,
//?    які задовольняють умови колбек-функції.
//? 🔸 Якщо колбек повернув true,
//?    елемент додається у масив, що повертається.
//? 🔸 Якщо колбек повернув false,
//?    елемент не додається у масив, що повертається.
//? 🔸 Якщо жоден елемент не задовольнив умову,
//?     повертає порожній масив.
//? ✳️ Аргументи колбек-функції - це:
//? 🔹 значення поточного елемента element,
//? 🔹 його індекс index
//? 🔹 і власне вихідний масив array.
console.log(
    `%c
    масив.reduce((element, index, array) => {
        // тіло колбек-функції
    });
    `,
    'color: blue; font-size: 18px',
);

console.warn("Приклад використання метода reduce():");
//? ✳️ Метод reduce() 
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");
console.log("----------------------------------------------------------------------------------------------");
