console.log(
    '%c 2.Метод sort(). ',
    'color: white; background-color: #D33F49',
);

//! 2.Метод sort()
console.warn("Синтаксис методу sort():");
//? ✴️ Метод sort() сортує елементи масиву,
//? але на відміну від інших методів перебирання,
//? він сортує вихідний масив.
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Сортує і змінює вихідний (оригінальний) масив.
//? 🔸 Повертає змінений масив, тобто посилання на відсортований вихідний (оригінальний) масив.
//? 🔸 За замовчуванням сортує за зростанням.
//? 🔸 Сортування відбувається шляхом приведення значень
//?    до рядка і порівняння порядкових номерів у таблиці Unicode.



console.warn("Приклад використання метода sort():");
//? ✳️ Такий масив чисел буде відсортований за зростанням:
const scores1 = [61, 19, 74, 35, 92, 56];
console.log("scores1_before:", scores1); //! [61, 19, 74, 35, 92, 56]
scores1.sort();
console.log("scores1_after:", scores1); //! [19, 35, 56, 61, 74, 92]
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . .");

//? ✳️ Але, оскільки за замовчуванням значення приводяться до рядка,
//? стандартне сортування чисел працює незвично.
//? Тому, у наступній вправі ми розглянемо як задавати свій порядок сортування.
const scores2 = [27, 2, 41, 4, 7, 3, 75];
console.log("scores2_before:", scores2); //! [27, 2, 41, 4, 7, 3, 75]
scores2.sort();
console.log("scores2_after:", scores2); //! [2, 27, 3, 4, 41, 7, 75]



// console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");
console.log("----------------------------------------------------------------------------------------------");
