console.log(
    '%c 3.Ланцюжки методів. ',
    'color: white; background-color: #D33F49',
);

//! 3.Ланцюжки методів
//? ✳️ У нас є масив об'єктів з іменами, балами і відвідуваними предметами кожного студента.
const students = [
    { name: "Манго", score: 83, courses: ["математика", "фізика"] },
    { name: "Полі", score: 59, courses: ["інформатика", "математика"] },
    { name: "Аякс", score: 37, courses: ["фізика", "біологія"] },
    { name: "Ківі", score: 94, courses: ["література", "інформатика"] },
];

//? ✳️ Необхідно отримати масив їхніх імен,
//? відсортованих за зростанням балів за тест.
//? З цією метою ми відсортуємо копію масиву методом sort(),
//? після чого методом map() створимо масив значень властивості name
//? з відсортованого масиву.
const sortedByAscendingScore = [...students].sort((a, b) => a.score - b.score);
const names1 = sortedByAscendingScore.map(student => student.name);

console.log("names1:", names1); //! ['Аякс', 'Полі', 'Манго', 'Ківі']
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . .");

//? ✳️ Проблема в тому, що у нас з'являються проміжні змінні
//? після кожної операції, крім фінальної.
//? Змінна sortedByAscendingScore - зайва
//? і необхідна тільки для зберігання проміжного результату.
//? ✳️ Позбутися таких «мертвих» змінних можна
//? за допомогою групування викликів методів у ланцюжку.
//? Кожний наступний метод буде виконуватися
//? на основі результату роботи попереднього.
//? 🔸 Робимо копію вихідного масиву перед сортуванням.
//? 🔸 На копії викликаємо метод sort().
//? 🔸 До результату роботи методу sort() застосовуємо метод map().
//? 🔸 Змінній names присвоюється результат роботи методу map().

const names2 = [...students]
    .sort((a, b) => a.score - b.score)
    .map(student => student.name);

console.log("names2:", names2); //! ['Аякс', 'Полі', 'Манго', 'Ківі']
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . .");

//? ✳️ Отримаємо масив унікальних відвідуваних предметів, відсортований за алфавітом.
//? 🔸 На вихідному масиві викликаємо flatMap() і робимо розгладжений масив усіх курсів.
//? 🔸 До результату методу flatMap() застосовуємо метод filter() для фільтрації унікальних елементів.
//? 🔸 На результаті методу filter() викликаємо sort().
//? 🔸 Змінній uniqueSortedCourses присвоюється результат роботи методу sort().
const uniqueSortedCourses = students
    .flatMap(student => student.courses)
    .filter((course, index, array) => array.indexOf(course) === index)
    .sort((a, b) => a.localeCompare(b));

console.log("uniqueSortedCourses:", uniqueSortedCourses);  //! ['біологія', 'інформатика', 'література', 'математика', 'фізика']
console.log("----------------------------------------------------------------------------------------------");
