// console.log('10.Практика:');
console.log(
  "%c 10.Практика: ",
  "color: white; background-color: #D33F49",
);


//! ПРАКТИКА-4 (Урок-04_JS)
//! Творчі завдання після логічних операторів
//todo [1]
console.log(
  "%c [1] ",
  "color: yellow; background-color: #2274A5",
);
//? Hапиши скрипт входження числа <number>
//?  у відрізок зазначений ВІД <х1> і ДО <х2>
//? та виведи в консоль ЧОТИРИ варіанти
//? знаходження числа <number>:
//? - ДО <х1>
//? - ПІСЛЯ <х2>
//? - ВІД <х1> ДО <х2>
//? - ДО <х1> або ПІСЛЯ <х2>
const x1 = 10;
const x2 = 30;
const number = 45;

//todo: var.1
console.log(`Число <number> входить у відрізок ДО <x1>? `, "умова");
console.log(`Число <number> входить у відрізок ПІСЛЯ <x2>? `, "умова");
console.log(`Число <number> входить у відрізок ВІД <x1> ДО <x2>? `, "умова");
console.log(`Число <number> входить у відрізок ДО <x1> або ПІСЛЯ <x2>? `, "умова");
console.log("------------------------------------------------------");

//todo: var.2
if ("умова") {
  console.log(`Число <number> ...`);
} else if ("умова") {
  console.log(`Число <number> ...`);
} else if ("умова") {
  console.log(`Число <number> ...`);
} else {
  console.log(`Число <number> НІКУДИ не входить!`);
}

