console.log(
    '%c 1.Об\'єктна модель документа(DOM-дерево) \n   HTML-документ і DOM.                  ',
    'color: white; background-color: #D33F49',
);

//! Об'єктна модель документа(DOM-дерево)
console.warn(`Об'єктна модель документа(DOM-дерево): \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_17/images/browser-js.png"}`);
//? ✳️ Коли ми працюємо з браузером,
//? доступний функціонал складається з декількох модулів,
//? оскільки JavaScript не має інструментів для роботи з браузером.

//? ✴️ ECMAScript — мова програмування, 
//? яка вбудовується розширюваною мовою програмування, 
//? що не має засобів введення-виведення, 
//? і використовується як основа для побудови інших скриптових мов.
//? ✴️ Об'єктна модель документа (Document Object Model)
//? - незалежний від мови інтерфейс для роботи з HTML-документом.
//? Містить набір властивостей і методів, що дозволяють шукати,
//? створювати і видаляти елементи, реагувати на дії користувача
//? і багато іншого.
//? Тобто з'єднує сторінку з мовою програмування.
//? ✳️ DOM - це відображення HTML-документа,
//? деревоподібна структура, в якій кожен вузол
//? - це JavaScript-об'єкт з властивостями і методами,
//? що становить частину HTML-документа.
//? Кожен елемент в документі, весь документ в цілому, заголовок,
//? посилання, абзац - це частини DOM цього документа,
//? тому всі вони можуть бути змінені з JavaScript-коду.
//? ✴️ Об'єктна модель браузера (Browser Object Model) 
//? - незалежний від мови інтерфейс для роботи з вкладкою браузера. 
//? Містить набір властивостей і методів, 
//? що дозволяють отримати доступ безпосередньо до поточної вкладки 
//? і ряду функцій браузера. 
//? Містить об'єкт роботи з історією навігації, 
//? місцем розташування та багато іншого.
console.log(
    `%c
    🟨 ECMAScript — мова програмування
    🟦 Document Object Model - для відображення HTML-документа
    🟥 Browser Object Model -  для роботи з вкладкою браузера
     .
    `,
    'color: gray; font-size: 16px',
);


console.log("---------------------------------------------------------------------------------------------");


//! HTML-документ і DOM
console.warn(`HTML-документ і DOM: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_17/images/dom-tree.png"}`);
//? ✴️
//? ✳️
//? 🔸 
console.log("`  `  `  `  `  `  `  `  `  `  `");
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("---------------------------------------------------------------------------------------------");
