console.log(
    '%c 1.Об\'єктна модель документа(DOM-дерево) \n   HTML-документ і DOM.                  ',
    'color: white; background-color: #D33F49',
);

//! Об'єктна модель документа(DOM-дерево)
console.warn(`Об'єктна модель документа(DOM-дерево): \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_17/images/browser-js.png"}`);
//? ✴️ 
//? ✳️ 
//? 🔸 
console.log(
    `%c
    🔴 .
    `,
    'color: blue; font-size: 16px',
);

console.log("`  `  `  `  `  `  `  `  `  `  `");
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("---------------------------------------------------------------------------------------------");


//! HTML-документ і DOM
console.warn(`HTML-документ і DOM: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_17/images/dom-tree.png"}`);
//? ✴️

console.log("---------------------------------------------------------------------------------------------");
