console.log(
    '%c 4.Використання властивостей елементів DOM-дерева. ',
    'color: white; background-color: #D33F49',
);

//! Використання властивостей елементів DOM-дерева
console.warn("Використання властивостей елементів DOM-дерева:");
//? ✴️ 
//? ✳️ 
//? 🔸 
console.log(
    `%c
    🔴 .
    `,
    'color: blue; font-size: 16px',
);

console.log("`  `  `  `  `  `  `  `  `  `  `");
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("---------------------------------------------------------------------------------------------");
