console.log(
    '%c 1.Бібліотека. \n   Фреймворк.  \n   Інструмент. ',
    'color: white; background-color: #D33F49',
);

//! Бібліотека
console.warn("Бібліотека:");
//? ✴️ Бібліотека — це структурований набір корисного функціоналу:
//? функцій, об'єктів або класів, які ви можете використовувати
//? в своєму додатку. Бібліотека абстрагує різні шари,
//? так що вам не потрібно турбуватися про їх деталі реалізації.
//? Бібліотека скорочує час розробки, дозволяючи вам не турбуватися
//? про дрібниці.

//? ✳️ Бібліотека може містити функції для роботи з рядками,
//? датами, DOM-елементами, подіями, анімацією, HTTP-запитами,
//? і багато іншого. Кожна функція може повертати значення коду,
//? який її викликає, який може в подальшому використовувати їх
//? в залежності від логіки розробника.

//? ✳️ Це можна порівняти з підбором запчастин для автомобіля:
//? ви вільні у виборі будь-якого варіанту, з яким машина буде працювати,
//? але логіка цілком на вашій совісті.

//?     📌 Мінуси використання бібліотек:
//? 🔸 Баг в реалізації бібліотеки може викликати складності в його знаходженні і виправленні.
//? 🔸 Немає гарантії, що команда розробників оперативно випустить патч.
//? 🔸 Патч може змінити API, що спричинить за собою значні зміни у вашому коді.

console.log(
    `%c
    📌 Мінуси використання бібліотек:
        🔸 Баг в реалізації бібліотеки може викликати складності в його знаходженні і виправленні.
        🔸 Немає гарантії, що команда розробників оперативно випустить патч.
        🔸 Патч може змінити API, що спричинить за собою значні зміни у вашому коді.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");


//! Фреймворк
console.warn("Фреймворк:");
//? ✴️ Фреймворк — це каркас (скелет) додатка.
//? Він зобов'язує розробника будувати архітектуру програми відповідно до деякої логікою,
//? а так само надає деякий інтерфейс для взаємодії з собою. Фреймворк зазвичай
//? надає функціонал на кшталт подій, сховищ і зв'язування даних, шаблонізацію та інше.

//? ✳️ За аналогією з машиною, фреймворк надає готові рами, корпус і двигун.
//? Ви можете додавати, видаляти або замінювати деякі деталі, при цьому припускаючи,
//? що автомобіль залишиться в робочому стані.

//? ✳️ Фреймворк знаходиться на більш високому рівні абстракції в порівнянні
//? з бібліотекою і дозволить вам без зусиль побудувати велику частину програми.

//? ✳️ Різниця між фреймворком і бібліотекою полягає в тому, що бібліотеку
//? ви використовуєте в своєму коді, а у випадку з фреймворком,
//? ви пишете свій код в архітектурних конструкціях фреймворку.


//?     📌Мінуси використання фреймворку:
//? 🔸 Фреймворк може накладати обмеження, тому можуть бути труднощі з впровадженням функціоналу.
//? 🔸 Велика екосистема пакетів може збивати з пантелику і вимагає часу на вивчення.

console.log(
    `%c
    📌 Мінуси використання фреймворку:
        🔸 Фреймворк може накладати обмеження, тому можуть бути труднощі з впровадженням функціоналу.
        🔸 Велика екосистема пакетів може збивати з пантелику і вимагає часу на вивчення.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");


//! Інструмент
console.warn("Інструмент:");
//? ✴️ Інструмент — це допоміжний засіб розробки,
//? але він не є невід'ємною частиною проєкту.
//? Інструменти включають в себе системи збирання, лінтери,
//? компілятори, транспайлери, системи розгортання та інше.

//? ✳️ Інструменти покликані полегшувати процес розробки. 
//? Наприклад, Babel, який надає можливість перетворення 
//? сучасного зручного в написанні JavaScript в більш старий стандарт, 
//? який може обробити більшість браузерів.
console.log("-------------------------------------------------------------------");
