console.log(
    '%c 1.Бібліотека. \n   Фреймворк.  \n   Інструмент. ',
    'color: white; background-color: #D33F49',
);

//! Бібліотека
console.warn("Бібліотека:");
//? ✴️ Бібліотека — це структурований набір корисного функціоналу:
//? функцій, об'єктів або класів, які ви можете використовувати
//? в своєму додатку. Бібліотека абстрагує різні шари,
//? так що вам не потрібно турбуватися про їх деталі реалізації.
//? Бібліотека скорочує час розробки, дозволяючи вам не турбуватися
//? про дрібниці.

//? ✳️ Бібліотека може містити функції для роботи з рядками,
//? датами, DOM-елементами, подіями, анімацією, HTTP-запитами,
//? і багато іншого. Кожна функція може повертати значення коду,
//? який її викликає, який може в подальшому використовувати їх
//? в залежності від логіки розробника.

//? ✳️ Це можна порівняти з підбором запчастин для автомобіля:
//? ви вільні у виборі будь-якого варіанту, з яким машина буде працювати,
//? але логіка цілком на вашій совісті.

//?     📌 Негативні сторони:
//? 🔸 Баг в реалізації бібліотеки може викликати складності в його знаходженні і виправленні.
//? 🔸 Немає гарантії, що команда розробників оперативно випустить патч.
//? 🔸 Патч може змінити API, що спричинить за собою значні зміни у вашому коді.

console.log(
    `%c
    📌 Негативні сторони використання бібліотек:
        🔸 Баг в реалізації бібліотеки може викликати складності в його знаходженні і виправленні.
        🔸 Немає гарантії, що команда розробників оперативно випустить патч.
        🔸 Патч може змінити API, що спричинить за собою значні зміни у вашому коді.
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");


//! Фреймворк
console.warn("Фреймворк:");



console.log("-------------------------------------------------------------------");


//! Інструмент
console.warn("Інструмент:");


console.log("-------------------------------------------------------------------");
