console.log(
    '%c 2.Пакетний менеджер npm. ',
    'color: white; background-color: #D33F49',
);

//! Пакетний менеджер npm
console.warn("Сайт npmjs.com : \n https://www.npmjs.com/");
//? ✴️ Щоб використовувати все різноманіття
//? інструментів (або пакетів) Node.js,
//? нам необхідна можливість встановлювати
//? і керувати ними.
//? Для цього створений NPM (node ​​package manager)
//? - пакетний менеджер Node.js.
//? Він встановлює потрібні пакети і забезпечує
//? зручний інтерфейс для роботи з ними.

//? 📌 NPM складається з трьох основних компонентів:
//?     🔸 Сайт npmjs.com — використовується для пошуку та ознайомлення з документацією пакетів.
//?     🔸 Інтерфейс командного рядка (CLI)
//?         — запускається з терміналу і надає набір команд
//?         для роботи з реєстром і пакетами.
//?     🔸 Реєстр пакетів (registry) — велика загальнодоступна
//?         база даних інструментів розробки (пакетів).
console.log(
    `%c
    📌 Основні компоненти NPM:
        🔸 Сайт npmjs.com
        🔸 Інтерфейс командного рядка (CLI)
        🔸 Реєстр пакетів (registry)
    `,
    'color: blue; font-size: 18px',
);

//? ✳️ Пакет (package) — невелика JavaScript бібліотека, 
//? що вирішує специфічне завдання. 
//? Пакети пишуть самі розробники і діляться зі спільнотою. 
//? Такий підхід спрощує життя, тому що не потрібно 
//? винаходити колесо, всі колеса вже давно лежать 
//? на полицях реєстру і готові до використання.
console.log("-------------------------------------------------------------------");
