console.log(
    '%c 4.Події елементів форм ',
    'color: white; background-color: #D33F49',
);

//! Подія submit​
console.warn("Подія submit​:");
//? ✴️ Відправлення форми відбувається під час кліку
//? по кнопці з атрибутом type="submit"
//? або натискання клавіші Enter,
//? перебуваючи в будь-якому її текстовому полі.
//? ✴️ Подію submit можна застосувати для
//? валідації (перевірки) форми перед відправленням,
//? оскільки на об'єкті події існує багато
//? корисних властивостей,
//? пов'язаних з елементами форми.
//? ✴️ Сабміт форми ❗️перезавантажує сторінку❗️,
//? тому не забувайте скасовувати
//? дію за замовчуванням методом ❗️preventDefault()❗️.
//?❗️ ✴️ Властивість elements DOM-елемента форми 
//?❗️ містить об'єкт з посиланнями на усі її елементи, 
//?❗️ які мають атрибут name. 
//?❗️ Тому в прикладі ми отримуємо значення полів, 
//?❗️ звертаючись до login.value і password.value.
const registerForm = document.querySelector(".form");

registerForm.addEventListener("submit", handleSubmit);

function handleSubmit(event) {
    event.preventDefault(); //todo: ❗️скасовує перезавантаження сторінки❗️
    const form = event.target;
    const login = form.elements.login.value;
    const password = form.elements.password.value;

    if (login === "" || password === "") {
        return console.log("❗️❗️❗️ Please fill in all the fields!");
    }

    console.log(`Login: ${login}, Password: ${password}`);
    form.reset();
};
console.log("----------------------------------------------------------------------------------");


//! Подія change​
console.warn("Подія change​​:");
//? ✴️ Відбувається після зміни елемента форми.
//? Для текстових полів або textarea
//? подія відбудеться не на кожному введенні символу,
//? а після втрати фокусу, що не завжди зручно.
//? Наприклад, доки ви набираєте щось у текстовому полі
//? - подія відсутня, але як тільки фокус пропав,
//? відбудеться подія change.
//? Для інших елементів, наприклад,
//? select, чекбоксів і радіо-кнопок,
//? подія change спрацьовує відразу під час вибору значення.
