// console.log('10.Практика:');
console.log(
  "%c 10.Практика: ",
  "color: white; background-color: #D33F49",
);


//! ПРАКТИКА-6 (Урок-06_JS)
//todo [1]
console.log(
  "%c [1] ",
  "color: yellow; background-color: #2274A5",
);
//? Напиши цикл, який пропонує в prompt ввести число більше 100.
//? Якщо користувач ввів інше число
//? або не число – попросити ввести ще раз,
//? доти він не введе число, більше 100.


//todo [2]
console.log(
  "%c [2] ",
  "color: yellow; background-color: #2274A5",
);
//todo: Частина 1
//? Спочатку напиши цикл, який пропонує ввести
//? в prompt число, що складається з будь-яких
//? 5(п'яти) або більше цифр.
//? Наприклад, 432639478.
//? Якщо користувач ввів щось менше 5(п'яти) цифр
//? або не число – попросити ввести ще раз,
//? доти він не введе будь-яких 5(п'ять) або більше цифр.
//todo: Частина 2
//? Потім перевір кожну цифру з введеного числа
//? на можливість ділення на 2 без залишку
//? та виведи у консоль повідомлення зі значенням позиції тих цифр,
//? які задовольнили цій умові у такому форматі:
//? "Цифра <number> ділиться на 2 без залишку і займає позицію <position>".
//? Якщо такі цифри не знайдені, виведи повідомлення:
//? "Цифри, які діляться на 2 без залишку відсутні".
