console.log(
    '%c 1.Імперативний і Декларативний код. ',
    'color: white; background-color: #D33F49',
);

//! Приклад Імперативного коду
console.warn(`Приклад Імперативного коду: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_14/images/imperative-programming-example.jpg"}`);

//? ✴️ 
//? ✳️ 

// console.log("book:", book);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("----------------------------------------------------------------------------------------------------------------------");


//! Приклад Декларативного коду
console.warn(`Приклад Декларативного коду: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE3_14/images/declarative-programming-example.jpg"}`);

//? ✴️ 
//? ✳️ 

// console.log("book:", book);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("----------------------------------------------------------------------------------------------------------------------");
