console.log(
    '%c 1.Імперативний і декларативний код. ',
    'color: white; background-color: #D33F49',
);

//! 1.Імперативний і декларативний код
console.warn("1.Імперативний і декларативний код:");
//? ✴️ 
//? ✳️ 

// console.log("book:", book);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("----------------------------------------------------------------------------------------------------------------------");
