console.log(
    '%c 3.Перебираючі методи. ',
    'color: white; background-color: #D33F49',
);

//! 3.Перебираючі методи
//? ✴️ В JavaScript є методи масивів,
//? що прийшли з функціональних мов.
//? Більшість з них - це чисті функції.
//? Вони створюють новий масив, заповнюють його,
//? застосовуючи до значення кожного елемента
//? зазначену колбек-функцію,
//? після чого повертають цей новий масив.
//? ✳️ Усі перебираючі методи масивів мають схожий синтаксис.
//? Вихідний масив array,
//? виклик методу method
//? і callback-функція callback як аргумент методу.
console.log(
    `%c
    array.method(callback[currentValue, index, array]);
    `,
    'color: red; font-size: 20px',
);

//? ✴️ У більшості методів аргументами callback-функції
//? є значення елемента currentValue (перший параметр),
//? позиція елемента index (другий параметр)
//? і сам вихідний масив array (третій параметр).
console.log(
    `%c
    array.method((item, idx, arr) => {
        // логіка, яка буде застосовуватися на кожній ітерації
    });
    `,
    'color: blue; font-size: 20px',
);

//? ✳️ Всі параметри, крім значення елемента item, - необов'язкові. 
//? Назви параметрів можуть бути будь-які, 
//? але є неофіційні домовленості.
console.log(
    `%c
    array.method(item => {
        // логіка, яка буде застосовуватися на кожній ітерації
    });
    `,
    'color: green; font-size: 20px',
);

console.log("---------------------------------------------------------------------------------------------------------");
