console.log(
    '%c 3.Перебираючі методи. ',
    'color: white; background-color: #D33F49',
);

//! 3.Перебираючі методи
console.warn("3.Перебираючі методи:");
//? ✴️ 
//? ✳️ 

// console.log("book:", book);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("----------------------------------------------------------------------------------------------------------------------");
