console.log(
    '%c 5.Методи map() і flatMap(). ',
    'color: white; background-color: #D33F49',
);

//! Метод map()
console.warn("Синтаксис методу map():");
//? ✴️ Метод map(callback) використовується
//? для трансформації масиву.
//? Він викликає колбек-функцію
//? для кожного елемента вихідного масиву,
//? а результат її роботи записує у новий масив,
//? який і буде результатом виконання методу.
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Не змінює оригінальний масив.
//? 🔸 Результат роботи колбек-функції записується у новий масив.
//? 🔸 Повертає новий масив однакової довжини.
//? ✳️ Аргументи колбек-функції - це:
//? 🔹 значення поточного елемента element,
//? 🔹 його індекс index
//? 🔹 і власне вихідний масив array.
console.log(
    `%c
    array.map((element, index, array) => {
        // тіло колбек-функції
    });
    `,
    'color: blue; font-size: 18px',
);

console.warn("Приклад використання метода map():");
//? ✳️ Його можна використовувати для того,
//? щоб змінити кожен елемент масиву.
//? Оригінальний масив використовується як еталон,
//? на основі якого можна зробити іншу колекцію.
const planets = ["Земля", "Марс", "Венера", "Юпітер"];
console.log("planets_before:", planets); //! ['Земля', 'Марс', 'Венера', 'Юпітер']

const planetsInUpperCase = planets.map(planet => planet.toUpperCase());
console.log("planetsInUpperCase:", planetsInUpperCase); //! ['ЗЕМЛЯ', 'МАРС', 'ВЕНЕРА', 'ЮПІТЕР']

const planetsInLowerCase = planets.map(planet => planet.toLowerCase());
console.log("planetsInLowerCase:", planetsInLowerCase); //! ['земля', 'марс', 'венера', 'юпітер']

//todo: Оригінальний масив не змінився:
console.log("planets_after:", planets); //! ['Земля', 'Марс', 'Венера', 'Юпітер']
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//! Масив об'єктів
console.warn("Масив об'єктів:");
//? ✳️ Ми вже знаємо, що повсякденне завдання
//? - це маніпуляція масивом об'єктів.
//? Наприклад, отримати масив значень властивості 
//? з усіх об'єктів. 
//? У нас є масив студентів, 
//? а потрібно отримати окремий масив їхніх імен.
const students1 = [
    { name: "Манго", score: 83 },
    { name: "Полі", score: 59 },
    { name: "Аякс", score: 37 },
    { name: "Ківі", score: 94 },
    { name: "Х'юстон", score: 64 },
];
console.log("students1:", students1);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");


const names = students1.map(student => student.name);
console.log("names:", names); //! ['Манго', 'Полі', 'Аякс', 'Ківі', 'Х'юстон']
console.log("------------------------------------------------------------------");


//! Метод flatMap()
console.warn("Синтаксис методу flatMap():");
//? ✴️ Метод flatMap(callback)
//? - аналогічний методу map(),
//? але застосовується у випадках,
//? коли результат - це багатовимірний масив,
//? який необхідно «розгладити»,
//? тобто він розгортає вкладені масиви на один рівень
//? 🔸 Поелементо перебирає оригінальний масив.
//? 🔸 Не змінює оригінальний масив.
//? 🔸 Результат роботи колбек-функції записується у новий масив.
//? 🔸 Повертає новий розгладжений масив,
//?    який «розгладжується» на глибину,
//?    що дорівнює одиниці (одна вкладеність).
//? ✳️ Аргументи колбек-функції - це:
//? 🔹 значення поточного елемента element,
//? 🔹 його індекс index
//? 🔹 і власне вихідний масив array.
console.log(
    `%c
    array.flatMap((element, index, array) => {
        // тіло колбек-функції
    });
    `,
    'color: blue; font-size: 18px',
);

console.warn("Приклад використання метода flatMap():");
const students2 = [
    { name: "Манго", courses: ["математика", "фізика"] },
    { name: "Полі", courses: ["інформатика", "математика"] },
    { name: "Ківі", courses: ["фізика", "біологія"] },
];
console.log("students2:", students2);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

const coursesByMap = students2.map(student => student.courses);
console.log("coursesByMap:", coursesByMap); //! [['математика', 'фізика'], ['інформатика', 'математика'], ['фізика', 'біологія']]

const coursesByFlatMap = students2.flatMap(student => student.courses);
console.log("coursesByFlatMap:", coursesByFlatMap); //! ['математика', 'фізика', 'інформатика', 'математика', 'фізика', 'біологія'];
console.log("------------------------------------------------------------------");
