console.log(
    '%c 6.Метод filter(). ',
    'color: white; background-color: #D33F49',
);

//! 6.Метод filter()
console.warn("6.Метод filter():");
//? ✴️ 
//? ✳️ 

// console.log("book:", book);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("----------------------------------------------------------------------------------------------------------------------");
