console.log(
    '%c 8.Методи every() і some(). ',
    'color: white; background-color: #D33F49',
);

//! 8.Методи every() і some()
console.warn("8.Методи every() і some():");
//? ✴️ 
//? ✳️ 

// console.log("book:", book);
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `  `");

console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("----------------------------------------------------------------------------------------------------------------------");
