console.log(
    '%c 1.CRUD. ',
    'color: white; background-color: #D33F49',
);

//! CRUD
console.warn(`CRUD: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_18/images/crud.png"}`);

//? ✴️ Для взаємодії з ресурсами бекенду
//? використовується чотири операції:
//? 🔸 створення (CREATE),
//? 🔸 читання (READ),
//? 🔸 оновлення (UPDATE)
//? 🔸 видалення (DELETE).
//? Для кожної з них визначений стандартний HTTP-метод.

//! Method	Description
//?     📌 ---:
//? 🔸 POST. Операція CREATE - створити новий ресурс.
//? 🔸 GET. Операція READ - отримати набір ресурсів
//?    або один ресурс за ідентифікатором.
//? 🔸 PUT і PATCH.	Операція UPDATE - оновити ресурс за ідентифікатором.
//? 🔸 DELETE. Операція delete - видалити ресурс за ідентифікатором

console.log(
    `%c
        📌 Method Description:

    🔸 POST. Операція CREATE - створити новий ресурс.
    🔸 GET. Операція READ - отримати набір ресурсів
       або один ресурс за ідентифікатором.
    🔸 PUT і PATCH.	Операція UPDATE - оновити ресурс за ідентифікатором.
    🔸 DELETE. Операція delete - видалити ресурс за ідентифікатором
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------------------------------");
