console.log(
    '%c 2.Оптимізація роботи з DOM ',
    'color: white; background-color: #D33F49',
);

//! Оптимізація роботи з DOM
//? ✴️ Сучасні браузери намагаються оптимізувати
//? процес відтворення сторінки без втручання розробника.
//? Проте, зміна DOM-дерева - це дорога операція,


//! Repaint 
console.warn("Repaint :");
//? ✴️ Repaint - відбувається,
//? коли зміни торкнулися стилів,
//? що впливають на зовнішній вигляд елемента,
//? але не на геометрію.
//? ✳️ Наприклад,
//? 🔸 opacity, 
//? 🔸 background-color, 
//? 🔸 visibility,
//? 🔸 outline. 
//? Браузер повторно створює елемент, 
//? з урахуванням нового стилю. 
//? Також перевіряється видимість інших елементів, 
//? один або більше можуть виявитися 
//? прихованими під елементом, 
//? що змінив зовнішній вигляд.
console.log(
    `%c
        ✴️ Repaint - відбувається,
    коли зміни торкнулися стилів,
    що впливають на зовнішній вигляд елемента,
    але не на геометрію.
        ✳️ Наприклад,
    🔸 opacity,
    🔸 background-color,
    🔸 visibility,
    🔸 outline.
    `,
    'color: blue; font-size: 16px',
);
console.log("--------------------------------------------------------------------------------------------");


//! Reflow
console.warn("Reflow:");
//? ✴️ Reflow - відбувається,
//? коли зміни впливають на:
//? 🔸 вміст,
//? 🔸 структуру документу,
//? 🔸 положення елементів.
//? Відбувається перерахунок позиціонування і розмірів,
//? що призводить до повторного створення частини
//? або всього документу.
//? Зміна розміру одного батьківського контейнера
//? вплине на всіх його дітей і предків.
//? ❗️Має значно більший вплив на продуктивність, ніж repaint❗️.
console.log(
    `%c
        ✴️ Reflow - відбувається,
    коли зміни впливають на:
    🔸 вміст,
    🔸 структуру документу,
    🔸 положення елементів.
        ✳️❗️Має значно більший вплив на продуктивність, ніж repaint❗️.
    `,
    'color: blue; font-size: 16px',
);
//? ✴️ Усі перераховані вище операції блокують браузер.
//? Сторінка не може виконувати жодні інші операції у той час,
//? коли відбувається reflow або repaint.
//? ✴️ Причинами можуть бути:
//? 🔸 Маніпуляції з DOM (додавання, видалення, зміна, перестановка елементів).
//? 🔸 Зміна вмісту, зокрема тексту в полях форм.
//? 🔸 Розрахунок або зміна CSS-властивостей.
//? 🔸 Додавання і видалення таблиць стилів.
//? 🔸 Маніпуляції з атрибутом class.
//? 🔸 Маніпуляції з вікном браузера (зміни розмірів, прокручування).
//? 🔸 Активація псевдокласів (наприклад, ':hover').
console.log("--------------------------------------------------------------------------------------------");
