console.log(
    '%c 6.Метод splice() ',
    'color: white; background-color: #D33F49',
);

//! Метод splice()
//? Швейцарський ніж для роботи з масивами,
//? якщо вихідний масив необхідно змінити /
//? Видаляє, додає і замінює елементи у довільному місці масиву.

// Метод splice ЗМІНЮЄ початковий масив і ПОВЕРТАЄ
// цей же масив масив, який вже містить зміни

//! Видалення елементів масиву за допомогою splice()
console.warn("splice() - видалення елементів масиву:");
//? Щоб видалити елементи в масиві, передаються два аргументи:
//? splice(position, num);
//? position — вказує індекс першого елемента для видалення
//? num — визначає кількість елементів, що видаляються.
//? Метод splice змінює вихідний масив і
//? ПОВЕРТАЄ масив, що містить видалені елементи.
const scores = [10, 20, 30, 40, 50]; 
console.log("scores:", scores); //! [10, 20, 30, 40, 50]

//? Видаляємо три елементи масиву, починаючи з другого елемента (індекс = 1):
const deletedScores = scores.splice(1, 3);

//? Тепер масив scores містить лише два елементи:
console.log("scores:", scores); //! [10, 50]

//? А масив deletedScores містить три видалені елементи:
console.log("deletedScores:", deletedScores); //! [20, 30, 40]
console.log("-----------------------------------------");


