console.log(
    '%c 1.Цикл while ',
    'color: white; background-color: #D33F49',
);
    
//! Що таке ЦИКЛ?
//? ЦИКЛ - керуюча конструкція, призначена для організації
//? багаторазового виконання набору інструкцій.

//? ТІЛО ЦИКЛУ - послідовність інструкцій,
//? призначена для багаторазового виконання.

//? ІТЕРАЦІЯ - одноразове виконання тіла циклу.

//? УМОВА ВИХОДУ - вираз, що визначає, чи буде
//? в черговий раз виконуватися ітерація,
//? або цикл завершиться.

//? ЛІЧИЛЬНИК - змінна, що зберігає поточний номер ітерації.
//? Цикл не обов'язково містить ЛІЧИЛЬНИК,
//? і він не повинен бути один, умова виходу з циклу може
//? залежати від декількох змінних, що змінюються в циклі.

//! 1.Цикл while - цикл з передумовою
console.warn("https://ruslan379.github.io/course-fe-html-css/lesson-FE3_06/images/while.png");
//? — цикл, який виконується, доки правдива якась умова,
//? зазначена ДО його початку.
//? Ця умова перевіряється ДО виконання тіла циклу,
//? тому тіло може не виконатися жодного разу, 
//? якщо умова від самого початку - хибна.
let counter = 0;

while (counter < 10) {
    console.log("ТІЛО ЦИКЛУ --> counter(ДО):", counter);
    counter += 1;
    console.log("ТІЛО ЦИКЛУ --> counter(ПІСЛЯ):", counter);
};
console.log("____ ПОЗА ЦИКЛУ --> counter:", counter);
console.log("-----------------------------------------");

//? ПРИКЛАД:
let clientCounter = 18;
// clientCounter = 30; //? після перевіпки умови(хибна) цикл НЕ виконується
const maxClients = 26;

while (clientCounter < maxClients) {
    console.log("ТІЛО ЦИКЛУ --> clientCounter(ДО):", clientCounter);
    clientCounter += 2;
    console.log("ТІЛО ЦИКЛУ --> clientCounter(ПІСЛЯ):", clientCounter);
};
console.log("____ ПОЗА ЦИКЛУ --> clientCounter:", clientCounter);
console.log("-----------------------------------------");

