console.log(
    '%c 4.Інструкції break і continue ',
    'color: white; background-color: #D33F49',
);

//! 4.Інструкції break і continue

//! Оператор break
//? Перервати виконання циклу можна в будь-який момент. 
//? Для цього існує оператор break, 
//? який повністю припиняє виконання циклу 
//? і передає управління на рядок після його тіла.
for (let i = 0; i <= 5; i += 1) {
    console.log("i:", i); 

    if (i === 3) {
        console.log("Знайшли число 3, перериваємо виконання циклу");
        break;
    }
};

console.log("Лог після циклу");
console.log("------------------");


//! Оператор continue
//? Перериває не увесь цикл, а тільки
//? виконання поточної ітерації.
//? Його використовують, якщо зрозуміло,
//? що на поточній ітерації циклу більше
//? немає що робити або взагалі не потрібно нічого робити,
//? і час переходити до наступної ітерації.
const number = 10;

for (let i = 0; i < number; i += 1) {
    console.log("for --> i:", i);
    if (i % 2 === 0) {
        // console.log("if --> i:", i);
        continue;
    }

    console.log("Непарне i: ", i); // 1, 3, 5, 7, 9
    console.log(". . . . . . .");
};
