console.log(
    '%c3.Операції spread і rest ',
    'color: white; background-color: #D33F49',
);


//! Операції spread і rest
//? ✴️ spread і rest - це новий синтаксис
//? для роботи з ітерабельними сутностями,
//? таких як рядок, масив або об'єкт.
//? ❗️ Його функціонал і назва залежить від місця застосування.


//! Операція spread (розпорошення, розпилення або передача аргументів)
//? ✴️ ... — spread, розпорошення, розпилення.
//? Дозволяє розпорошити колекцію елементів в іншу колекцію,
//? зробивши копію оригінальної не зраджуючи її.
//? При цьому, під час розпилення,
//? якщо елемент колекції примітив — створюється копія елемента,
//? в разі складного типу створюється посилання на оригінальний елемент.
//? ✳️ Розпилення можна використовувати всього в 3-х ситуаціях:
//? 1️⃣ Під час виклику функції, для передачі масиву елементів окремими аргументами.
//? 2️⃣ У літералі масиву, при створенні нового масиву.
//? 3️⃣ У літералі об'єкта, при створенні нового об'єкта.


//! 1️⃣ Операція spread. Розпилення аргументів (передача аргументів)
console.warn("Операція spread. \n  1️⃣ Розпилення аргументів (передача аргументів):");
//? ✳️ Наприклад, у нас є масив температур за якийсь період,
//? і необхідно програмно знайти найменшу температуру в масиві
//? використовуючи метод Math.min(),
//? який очікує кілька аргументів, а не масив❗️.
//? ✳️❗️ Якщо передати просто масив, отримаємо NaN,
//? тому що Math.min() не вміє працювати з масивом❗️.
let temperatures = [18, 14, 12, 21, 17, 29];
//todo: ❌ Так не спрацює, тому що передаємо цілий масив:
let min = Math.min(temperatures); 
console.log("❌ min:", min); //! NaN

//? ✴️ Зробити це нам допоможе операція розпилення spread, 
//? яка передає елементи масиву 
//? окремими аргументами при виконанні функції.
temperatures = [18, 14, 12, 21, 17, 29];
//todo: ✅ Розподілимо колекцію елементів в якості набору окремих значень:
min = Math.min(...temperatures); 
console.log("✅ min:", min); //! 12
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//! 2️⃣ Операція spread. Cтворення нового масиву (копія масиву)
console.warn("Операція spread. \n  2️⃣ Cтворення нового масиву (копія масиву):");
//? ✳️ Операція ... (spread) дозволяє створити 
//? копію масиву або «склеїти» довільну кількість масивів в один новий. 
//? Раніше для цього використовували методи slice() і concat(), 
//? але операція розподілу дозволяє зробити те саме у коротшій формі.
const temps = [14, -4, 25, 8, 11];
console.log("temps:", temps); //! [14, -4, 25, 8, 11]
//todo: Це точна, але незалежна копія масиву temps:
const copyTemps = [...temps];
console.log("copyTemps:", copyTemps); //! [14, -4, 25, 8, 11]
console.log("`  `  `  `  `  `  `  `  `  `  `  `  `");

copyTemps[0] = 0;
console.log("temps:", temps); //! [14, -4, 25, 8, 11]
console.log("copyTemps:", copyTemps); //! [0, -4, 25, 8, 11]
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//? ✳️ Операція ... (spread) дозволяє,
//? створюючи нові масиви, замінити метод concat()
const lastWeekTemps = [-14, -25, -11];
console.log("lastWeekTemps:", lastWeekTemps); //! [-14, -25, -11]

const currentWeekTemps = [23, 17, 18];
console.log("currentWeekTemps:", currentWeekTemps); //! [23, 17, 18]

const allTemps = [...lastWeekTemps, ...currentWeekTemps];
console.log("allTemps:", allTemps); //! [-14, -25, -11, 23, 17, 18]
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//! 3️⃣ Операція spread. Cтворення нового об'єкта (копія об'єкта)
console.warn("Операція spread. \n  2️⃣ Cтворення нового об'єкта (копія об'єкта):");
//? ✳️ Операція ... (spread) дозволяє створити копію об'єкта, тобто,
//? розподілити властивості довільної кількості об'єктів в один новий.
const first = {
    propA: 5,
    propB: 10
};
const second = {
    propC: 15
};

const third1 = {...first, ...second};
console.log("third1:", third1); //! {propA: 5, propB: 10, propC: 15}

const third2 = {...second, ...first};
console.log("third2:", third2); //! {propC: 15, propA: 5, propB: 10}
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//? ✴️❗️ Порядок розподілу об'єктів має значення.
//? Імена властивостей об'єкта - унікальні,
//? тому властивості об'єкта, що розподіляється,
//? можуть перезаписати❗️ значення вже існуючої властивості,
//? якщо їх імена збігаються❗️.
const firstNew = {propA: 5, propB: 10, propC: 50};
const secondNew = {propC: 15, propD: 20};

const thirdNew = { ...firstNew, ...secondNew };
console.log("thirdNew:", thirdNew); //! {propA: 5, propB: 10, propC: 15, propD: 20}

const fourthNew = { ...secondNew, ...firstNew };
console.log("fourthNew:", fourthNew); //! {propA: 5, propB: 10, propC: 50, propD: 20}
console.log("---------------------------------------------------------");



//! 🅰️ Операція rest (збирання всіх аргументів функції)
console.warn("🅰️ Операція rest \n  (збирання всіх аргументів функції):");
//? ✴️ Операція ...(rest) дозволяє
//? зібрати групу незалежних елементів у нову колекцію)(масив).
//? ✳️ Синтаксично, ...(rest) - це близнюк операції розподілу,
//? але відрізнити їх просто:
//? - розподіл, (spread) - коли ... знаходиться у ПРАВІЙ❗️ частині операції присвоювання,
//? а збирання, (rest) - коли ... знаходиться в її ЛІВІЙ❗️ частині операції присвоювання.
//? ✴️ Операція ... (rest) може
//? зібрати в масив ВСІ аргументи функції.
function multiply(...args) {
    console.log("args:", args); //todo: масив усіх аргументів
};

multiply(1, 2);
multiply(1, 2, 3);
multiply(1, 2, 3, 4);
multiply([1, 2, 3, 4]); //! ❓❓❓
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . .");


//! 🅱️ Операція rest (збирання частини аргументів функції)
console.warn("🅱️ Операція rest \n  (збирання частини аргументів функції):");
//? ✴️ Операція ... (rest) також дозволяє
//? зібрати в масив тільки ту ЧАСТИНУ аргументів,
//? яка необхідна, оголосивши деякі параметри до «збирання».
//? ✳️ Всі аргументи, для яких будуть оголошені параметри,
//? передадуть їм свої значення,
//? інші аргументи будуть поміщені в масив.
//? ✳️❗️ Операція rest збирає решту усіх аргументів,
//? а тому повинна бути останньою❗️ у списку усіх аргументів функції, 
//? інакше виникне помилка.
function multiply2(firstNumber, secondNumber, ...otherArgs) {
    console.log("firstNumber:", firstNumber); //todo: Значення першого аргументу
    console.log("secondNumber:", secondNumber); //todo: Значення другого аргументу
    console.log("otherArgs:", otherArgs); //todo: Масив інших аргументів
    console.log("`  `  `  `  `  `  `  `  `");
};

multiply2(1, 2);
multiply2(1, 2, 3);
multiply2(1, 2, 3, 4);
multiply2([1, 2, 3, 4]); //! ❓❓❓
console.log("---------------------------------------------------------");
