//! 1.Інструкція (statement)
// Інструкція - це пов'язаний набір слів і символів, які об'єднуються, 
// щоб висловити одну ідею, тобто одну інструкцію для машини
a = b * 2;


//! 2.Вираз (expression) 
// Інструкції складаються із частин, 
// як і в будь-якій мові речення складаються із фраз 
// і ці фрази називаються виразами.
// Вираз - це посилання на змінну чи значення, 
// або на набір змінних і значень у поєднанні з операторами.

// 2 — вираз значення літерала. 
// b та a — вирази змінних. 
// b * 2 — арифметичний вираз множення. 
a = b * 2 // — вираз присвоювання. 


//! 3.Літерал — це значення
// яке вказується безпосередньо в коді програми та представляє певний тип даних

//? 3-1.Числовий літерал
10

//? 3-2.Рядковий літерал
"JavaScript is awesome!"


//! 4.Інтерфейс
// Інтерфейс  — це набір властивостей і методів сутності, 
// оступних для використання у вихідному коді.

//? 4-1.Властивість - описові характеристики
// сутність.ім`я_властивості
"JavaScript is awesome".length;

//? 5-1.Метод - активна операція
// сутність.ім`я_метода()
"JavaScript is awesome".toUpperCase();
