// 1. Інструкція (statement)
// це пов'язаний набір слів і символів, які об'єднуються, 
// щоб висловити одну ідею, тобто одну інструкцію для машини
a = b * 2;

// 2. Вираз (expression) 
// це посилання на змінну чи значення, 
// або на набір змінних і значень у поєднанні з операторами.

// 2 — вираз значення літерала. 
// b та a — вирази змінних. 
// b * 2 — арифметичний вираз множення. 
// a = b * 2 — вираз присвоювання. 

// 3. Літерал — це значення
// яке вказується безпосередньо в коді програми та представляє певний тип даних

// Числовий літерал
10

// Рядковий літерал
"JavaScript is awesome!"

//4. Властивість - описові характеристики
// сутність.ім`я_властивості
"JavaScript is awesome".length;

// Метод - активна операція
// сутність.ім`я_метода()
"JavaScript is awesome".toUpperCase();
