// Ств змінну з іменем age і присвоїти їй значення свого віку.
//  Вивести значення цієї змінної в консоль.

// const age = 31;
// console.log('age', age);

// Ств змінну з іменем name і присвоїти їй значення свого імені. 
// Вивести значення цієї змінної в консоль.

// const name = "Kate";
// console.log(name);

// Ств змінну з іменем isStudent і присвоїти їй значення true або false, 
// залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

// const isStudent = false;
// console.log(isStudent);

// Ств змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
//  Вивести цей рядок в консоль.

// const myString = "Even if you are eaten, you still have two ways out";
// console.log(myString);

// Ств змінну з іменем myNumber і присвоїти їй довільне числове значення. 
// Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

// let myNumber = 12;
// myNumber = myNumber + 10;
// console.log(myNumber);

// Ств змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

// const myNull = null;
// console.log(myNull);

// Ств скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt(). 
// Після введення імені вивести повідомлення привітання з використанням введеного імені.

// const message = "Enter your name";
// const clientName = prompt(message);
// const greeting = "Hello " + clientName;
// alert(greeting);



// Ств скрипт який виводить спливаюче підтвердження за допомогою confirm(). 
// Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". 
// Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

// const question = "Are you ready?";
// const answer = confirm(question);
// if (answer ){
//     alert("Дякую за підтвердження!");
// } else {
//     alert("Дію відмінено!");
// }

// Ств скрипт який виводить спливаюче попередження за допомогою alert(). 
// Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm(). 
// Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!". 
// Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"

// const warning = "дія небезпечна, підтвердіть дію";
// alert(warning);
// const clientAnswer = confirm(warning);
// if (clientAnswer ){
//     alert("Дякую за підтвердження!");
// } else {
//     alert("Дію відмінено!");
// }
