console.log(
    '%c 1.Поширення подій ',
    'color: white; background-color: #D33F49',
);

//! Присвоєння за значенням і за посиланням
console.warn(`Поширення подій​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_01/images/event-flow.png"}`);
//! Поширення подій​
console.warn("Поширення подій​:");
//? ✴️ Поширення подій (event propagation)
//? - це термін, що описує життєвий цикл події,
//? який має три етапи: занурення, таргетинг і спливання.
//? На практиці найчастіше використовують тільки ❗️фазу спливання❗️.

//? ✳️ Під час настання події, вона проходить через три обов'язкові фази:
//? 🔸 Capturing phase (занурення) -
//?    подія починається на window і тоне (проходить через усі елементи-предки)
//?     до найглибшого цільового елемента, на якому відбулася дія, наприклад, клік.
//? 🔸 Target phase (таргетинг) - подія дійшла до цільового елемента.
//?    Цей етап містить тільки повідомлення елемента про те, що на ньому відбулася дія.
//? 🔸 ❗️Bubbling phase❗️ (спливання) -
//?    кінцева фаза, подія спливає від найглибшого, цільового елемента,
//?    через усі елементи-предки до window.
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");

console.log("-------------------------------------------------------------------------------------------------------------");
