console.log(
    '%c 4.Обробка помилок ',
    'color: white; background-color: #D33F49',
);

//! Конструкція try...catch
console.warn("Конструкція try...catch:");
//? ✴️ Якщо методам класу JSON передати невалідний JSON,
//? то вони «викинуть» помилку і весь скрипт впаде.
//? Для уникнення цього, використовується конструкція try...catch,
//? яка дозволяє «ловити» і обробляти помилки виконання скрипта.
console.log(
    `%c
    try {
        // Code that may throw a runtime error
    } catch (error) {
        // Error handling
    }
    `,
    'color: blue; font-size: 18px',
);
//?   📌 Алгорити роботи конструкції try...catch:
//? 🔸 1.Спочатку виконується код всередині блоку try.
//? 🔸 2.Якщо помилки відсутні, блок catch ігнорується
//?     і управління передається далі.
//? 🔸 3.Якщо в блоці try сталася помилка,
//?     його виконання зупиняється
//?     та інтерпретатор переходить до блоку catch.

//? ✴️ Змінна error - це об'єкт помилки
//? з інформацією про те, що сталося.
//?     📌У цього об'єкта error є кілька корисних властивостей:
//? 🔸 name - тип помилки. Для помилки парса - це SyntaxError.
//? 🔸 message - повідомлення про деталі помилки.
//? 🔸 stack - стек викликів функцій на момент помилки.
//?     Використовується для налагодження.
console.log("-------------------------------------------------------------------------------");


//! Приклад-1, парса рядка як невалідного JSON
console.warn("Приклад-1, парса рядка як невалідного JSON:");
//? ✳️ Наприклад, парс рядка призведе до такого сценарію
//? - під час аналізу скрипт завершиться збоєм,
//? тому що рядок з символами - це невалідний JSON,
//?  оскільки не може бути перетворений у валідне JavaScript значення.
//todo: Під час аналізу цей скрипт завершиться збоєм:
let data = "oчікує JSON...";
// data = JSON.parse("Well, this is awkward"); //! Uncaught SyntaxError: Unexpected token 'W', "Well, this"... is not valid JSON
console.log("data:", data); //! цей код вже не виконається

//? ✳️ Використовуючи конструкцію try...catch,
//? ми можемо обробити цей виняток таким чином,
//? щоб скрипт продовжив працювати, навіть у разі помилки.
try {
    const data = JSON.parse("Well, this is awkward");
    console.log("data in try:", data); //! цей код вже не виконається, якщо є помилка
} catch (error) {
    console.log(error.name); //! SyntaxError
    console.log(error.message); //! Unexpected token 'W', "Well, this"... is not valid JSON
};
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("1️⃣✅ Ми бачимо це повідомлення, тому що обробили помилку парса в try...catch!");
console.log("-------------------------------------------------------------------------------");


//! Приклад-2, парса рядка як невалідного JSON
console.warn("Приклад-2, парса рядка як невалідного JSON:");
//? ✳️ Те саме буде і в цьому прикладі
//? при спробі парса невалідного JSON,
//? який може прийти з бекенду або бути прочитаний з файлу.
//? У цьому прикладі у властивості username бракує подвійних лапок.
try {
    data = JSON.parse('{"username": "Mango"}'); // ✅
    // data = JSON.parse('{username: "Mango"}'); //❌
    console.log("data in try:", data); //! цей код вже не виконається, якщо є помилка
} catch (error) {
    console.log(error.name); //! SyntaxError
    console.log(error.message); //! Unexpected token 'W', "Well, this"... is not valid JSON
};
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .");
console.log("data:", data); //! "oчікує JSON...", якщо - catch(ПОМИЛКА) або {username: 'Mango'}, якщо - try(ВІРНО)
console.log("2️⃣✅ Ми бачимо ці повідомлення, тому що обробили помилку парса в try...catch!");
console.log("-------------------------------------------------------------------------------");
