console.log(
    '%c 1.Створення дати. Клас Date. ',
    'color: white; background-color: #D33F49',
);

//! Дата і час
//? ✴️ Клас Date безпосередньо абстрагує більшу частину роботи з датами.
//? Це дозволяє нам відображати моменти у часі як об'єкти
//? і маніпулювати ними заздалегідь визначеними методами.
//? Використовуючи можливості класу Date, можна створювати годинник,
//? лічильники, календарі та інші інтерактивні елементи інтефрейсу.


//! Дата і час
console.warn("Дата і час:");
//? ✴️ Екземпляр об'єкта Date - це об'єкт, що відображає певний момент часу.
//? Створення дати без аргументів повертає об'єкт, що зберігає дату і час
//? на момент його ініціалізації, тобто поточні.
//? У рядковому перетворенні об'єкт повертає результат виклику
//? методу toString(), тому у першому лозі ми отримаємо рядок, а не об'єкт.
console.log(
    `%c
    const date = new Date();

    const startDate = new Date(1);
    `,
    'color: blue; font-size: 18px',
);

const date = new Date();

console.log("date:", date); //! "Thu Jul 24 2025 19:36:39 GMT+0300 (Восточная Европа, летнее время)"
console.log("typeof (date):", typeof (date));

console.log("date.toString():", date.toString()); //! "Thu Jul 24 2025 19:36:39 GMT+0300 (Восточная Европа, летнее время)"
console.log("typeof (date.toString()):", typeof (date.toString()));

const startDate = new Date(1);
console.log("startDate:", startDate); //! Thu Jan 01 1970 03:00:00 GMT+0300 (Восточная Европа, стандартное время)
console.log("------------------------------------------------------------------------------------");
