console.log(
    '%c 1.Створення дати. Клас Date. ',
    'color: white; background-color: #D33F49',
);

//! Дата і час. Створення дати
//? ✴️ Клас Date безпосередньо абстрагує більшу частину роботи з датами.
//? Це дозволяє нам відображати моменти у часі як об'єкти
//? і маніпулювати ними заздалегідь визначеними методами.
//? Використовуючи можливості класу Date, можна створювати годинник,
//? лічильники, календарі та інші інтерактивні елементи інтефрейсу.


//! Клас Date
console.warn("Клас Date:");
//? ✴️ Екземпляр об'єкта Date - це об'єкт, що відображає певний момент часу.
//? Створення дати без аргументів повертає об'єкт, що зберігає дату і час
//? на момент його ініціалізації, тобто поточні.
//? У рядковому перетворенні об'єкт повертає результат виклику
//? методу toString(), тому у другому лозі ми отримаємо рядок, а не об'єкт.
console.log(
    `%c
    const date = new Date();

    const startDate0 = new Date(0);
    `,
    'color: blue; font-size: 18px',
);

const date = new Date();

console.log("date:", date); //! "Thu Jul 24 2025 19:36:39 GMT+0300 (Восточная Европа, летнее время)"
console.log("typeof (date):", typeof (date)); //! object

console.log("date.toString():", date.toString()); //! "Thu Jul 24 2025 19:36:39 GMT+0300 (Восточная Европа, летнее время)"
console.log("typeof (date.toString()):", typeof (date.toString())); //! string
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . .");


//? ✳️ Оскільки не були передані аргументи, буде створена поточна дата і час.
//? Однак, можна додатково передати рядок або число в Date, 
//? і результатом буде об'єкт, що описує зазначену дату і час:
const startDate0 = new Date(0);
console.log("startDate0 = new Date(0):", startDate0); //! Thu Jan 01 1970 03:00:00 GMT+0300 (Восточная Европа, стандартное время)
const startDate1000 = new Date(1000);

console.log("startDate1000 = new Date(1000):", startDate1000); //! Thu Jan 01 1970 03:00:00 GMT+0300 (Восточная Европа, стандартное время)
console.log("--------------------------------------------------------------------------------------------------------");
