console.log(
    '%c 2.Створення дати:                     \n   Клас new Date(7 аргументів). ',
    'color: white; background-color: #D33F49',
);

//! Створення дати. 7 аргументів.
console.warn("Створення дати. 7 аргументів.:");
//? ✴️ Інший спосіб створення нових об'єктів Date — це передати 7 чисел.
//? Ці числа описують рік, місяць, день, годину, хвилину, секунду і мілісекунду.
//? ✴️ Останні 4 аргументу необов'язкові.
console.log(
    `%c
    ❗️❗️❗️ Індекси місяців починаються з 0 ❗️❗️❗️

    const fullDate = new Date(
        year,
        month,
        date,
        hours,
        minutes,
        seconds,
        ms
    )
    `,
    'color: blue; font-size: 18px',
);
const fullDate = new Date(2030, 2, 16, 14, 25, 0, 0); //! індекси місяців починаються з 0, тому 5-й місяць це липень.
console.log('fullDate = new Date(2030, 2, 16, 14, 25, 0, 0):\n', fullDate);  //! "Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)"
console.log("-------------------------------------------------------------------------");
