console.log(
    '%c 2.Створення дати:                     \n   Клас new Date(7 аргументів). ',
    'color: white; background-color: #D33F49',
);

//! Створення дати. 7 аргументів.
console.warn("Створення дати. 7 аргументів.:");
//? ✴️ Інший спосіб створення нових об'єктів Date — це передати 7 чисел.
//? Ці числа описують рік, місяць, день, годину, хвилину, секунду і мілісекунду.
console.log(
    `%c
    ❗️❗️❗️ Індекси місяців починаються з 0 ❗️❗️❗️

    const fullDate = new Date(
        year,
        month,
        date,
        hours,
        minutes,
        seconds,
        ms
    )
    `,
    'color: blue; font-size: 18px',
);
const fullDate = new Date(2000, 5, 8, 12, 0, 0, 0); //! індекси місяців починаються з 0, тому 5-й місяць це липень.
console.log('fullDate = new Date(2000, 5, 8, 12, 0, 0, 0):\n', fullDate);  //! "Thu Jun 08 2000 12:00:00 GMT+0300 (Восточная Европа, летнее время)"
console.log("--------------------------------------------------------------------");
