console.log(
    '%c 3.Unix час. ',
    'color: white; background-color: #D33F49',
);

//! Unix час
console.warn("Unix час:");
//? ✴️ Внутрішньо дати відображені в мілісекундах, 
//? що минули після опівночі 1 січня 1970 року у часовому поясі UTC. 
//? Для комп'ютера - це дата початку відліку часу - Unix час. 
//? Тому під час ініціалізації дати одним числом, 
//? воно являє собою кількість мілісекунд, що вже минула.
console.log(
    `%c
    - Дата початку відліку часу - 1 січня 1970 року,
    - Unix час,
    - timestamp.

    const startDate0 = new Date(0); 
    `,
    'color: blue; font-size: 18px',
);

//? ✳️ В клас Date можна додатково передати число,
//? і результатом буде об'єкт, що описує зазначену дату і час.
const startDate0 = new Date(0); //! дата початку відліку часу - 1 січня 1970 року - Unix час - timestamp
console.log("startDate0 = new Date(0):", startDate0); //! Thu Jan 01 1970 03:00:00 GMT+0300 (Восточная Европа, стандартное время)
const startDate1000 = new Date(1000);

//! Повертає числове значення цієї дати (timestamp) - кількість мілісекунд, що минула з півночі 1 січня 1970 року.
console.log("startDate1000 = new Date(1000):", startDate1000); //! Thu Jan 01 1970 03:00:01 GMT+0300 (Восточная Европа, стандартное время)

console.log("new Date(1899894300000):", new Date(1899894300000)); //! Sat Mar 16 2030 19:25:00 GMT+0200 (Восточная Европа, стандартное время)

console.log("--------------------------------------------------------------------------------------------------------");

