console.log(
    '%c 5.Методи new Date(): Сеттери. ',
    'color: white; background-color: #D33F49',
);

//! Методи new Date(): Сеттери
//? ✴️ Все, що можна прочитати - можна записати,
//? методи для запису називаються також геттери,
//? але починаються з префіксу set.
//? Також для всіх методів існують їх UTC еквіваленти.
console.log(
    `%c
    const date = new Date();
    -------------------------------------------------------------------------------
    date.setDate() - встановлює день місяця від 1 до 31

    date.setDay() -  встановлює день тижня від 0 до 6

    date.setMonth() - встановлює місяць від 0 до 11

    date.setFullYear() - встановлює рік з 4 цифр

    date.setHours() - встановлює години

    date.setMinutes() - встановлює хвилини

    date.setSeconds() - встановлює секунди

    date.setMilliseconds() - встановлює мілісекунди

    date.setTime() - встановлює кількість мілісекунд минулих зі старту епохи Unix
    -------------------------------------------------------------------------------
    `,
    'color: blue; font-size: 18px',
);
const date = new Date("March 16, 2030 14:25:00");
console.log("date: ", date); //! Sat Mar 16 2030 14:25:00 GMT+0200 (Восточная Европа, стандартное время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");

console.log("date.setMinutes(50):", date.setMinutes(50)); //! 1899895800000
console.log("date-->setMinutes(50): ", date); //! Sat Mar 16 2030 14:50:00 GMT+0200 (Восточная Европа, стандартное время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");

console.log("date.setFullYear(2040, 4, 8):", date.setFullYear(2040, 4, 8)); //! 2220090600000
console.log("date-->setFullYear(2040, 4, 8): ", date); //! Tue May 08 2040 14:50:00 GMT+0300 (Восточная Европа, летнее время)
console.log(". . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .  . . . . . . . . . . . . . . .");


console.log("date.setTime():", date.setTime(3330090600000)); //! 3330090600000
console.log("date-->date.setTime(3330090600000): ", date); //! Thu Jul 11 2075 20:10:00 GMT+0300 (Восточная Европа, летнее время)
console.log("----------------------------------------------------------------------------------------------------------------------------");
