console.log(
    '%c 1.AJAX ',
    'color: white; background-color: #D33F49',
);

//! AJAX
console.log(
    `%c
    AJAX (Asynchronous JavaScript and XML)
    - метод отримання або відправлення даних
    з подальшим оновленням інтерфейсу за цими даними,
    без потреби перезавантаження сторінки.
    `,
    'color: blue; font-size: 18px',
);
//? ✴️ AJAX (Asynchronous JavaScript and XML)
//? - метод отримання або відправлення даних
//? з подальшим оновленням інтерфейсу за цими даними,
//? без потреби перезавантаження сторінки.
//? Завдяки цьому зменшується час відгуку
//? і веб-сторінка стає інтерактивнішою.
//? Цей процес можна розібрати
//? на прикладі завантаження даних:

//? 🔸 1. На веб-сторінці відбувається подія
//?       (сторінка завантажується, натискається
//?       кнопка «Показати більше»,
//?       відправляється форма тощо).
//? 🔸 2. На клієнті, за допомогою JavaScript,
//?       реакцією на цю подію буде виконуватися
//?       функція для роботи з сервером,
//?       де створюється і відправляється HTTP-запит.
//? 🔸 3. Сервер отримує і обробляє HTTP-запит,
//?       відправляючи назад у відповіді дані у форматі JSON.
//? 🔸 4. На клієнті, за допомогою JavaScript,
//?       відповідь від сервера обробляється,
//?       зчитуються дані і оновлюється інтерфейс.

//? ✳️ Незважаючи на те, що у назві технології присутній XML, 
//? в сучасному інтернеті його замінив JSON, а назву залишили 
//? як данину пам'яті. AJAX трактується як будь-яке спілкування 
//? з сервером без перезавантаження сторінки.
console.log("---------------------------------------------------------------------------------");
