console.log(
    '%c 3.Перевірка відповіді методу fetch(). \n   Вкладка Network.                    ',
    'color: white; background-color: #D33F49',
);

//! Перевірка відповіді методу fetch()
console.warn("Перевірка відповіді методу fetch():");
//? ✴️ Значення промісу, який повертає метод fetch(),
//? - це об'єкт зі службовою інформацією про стан відповіді сервера.
//? Екземпляр класу Response містить різні методи і властивості.

//? ✳️ Залежно від типу отримуваного контенту, використовуються
//? різні методи для перетворення тіла відповіді у дані:
//? 🔸 json() - парсить дані в JSON-форматі.
//? 🔸 text() - парсить дані в простому текстовому форматі,
//?    наприклад .csv (табличні дані).
//? 🔸 blob() - парсить дані, що описують файл,
//?    наприклад, зображення, аудіо або відео.

//? ✳️ У першому методі then() виконується перевірка статусу відповіді 
//? і перетворення даних у правильний формат, або явне створення помилки, 
//? щоб обробити невдалий HTTP-запит в блоці catch(). 
console.log(
    `%c
    fetch("https://jsonplaceholder.typicode.com/users")
        .then(response => {
            if (!response.ok) {
                throw new Error(response.status);
            }
            return response.json();
        })
        .then(data => {
            // Data handling
            console.log("data:", data);
        })
        .catch(error => {
            // Error handling
        });

    `,
    'color: blue; font-size: 18px',
);
fetch("https://jsonplaceholder.typicode.com/users")
    .then(response => {
        if (!response.ok) {
            throw new Error(response.status);
        };
        return response.json();
    })
    .then(data => {
        //! Data handling
        console.log("data:", data); //! масив об'єктів з користувачами
    })
    .catch(error => {
        //! Error handling
        console.log("error:", error);
    })
    .finally(() => console.log("------------------------------------------------------------------------------------"));

//? ✳️ Це необхідно для того, щоб fetch() правильно зреагував
//? на статус код 404, який, технічно, не є помилкою,
//? але для клієнта - це неуспішний результат.
// console.log("------------------------------------------------------------------------------------");


//! Вкладка Network
setTimeout(() => {
    console.warn(`Вкладка Network-1​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_16/images/network-tab-1.jpg"}`);
    console.warn(`Вкладка Network-2​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_16/images/network-tab-2.png"}`);
    console.log("------------------------------------------------------------------------------------");
}, 200);
//? ✴️ В інструментах розробника на вкладці Network
//? відображаються всі HTTP-запити,
//? що виконуються на сторінці.
//? Вибравши фільтр Fetch/XHR,
//? залишаться тільки запити до бекенду. 
//? Після натискання кнопки в прикладі, 
//? через деякий час запит відобразиться у списку. 
//? Вибравши його, можна подивитися службову 
//? інформацію і тіло відповіді 
//? на підвкладках Headers, Preview і Response.
// console.log("------------------------------------------------------------------------------------");
