console.log(
    '%c 1.Node.js. Встановлення. ',
    'color: white; background-color: #D33F49',
);

//! Node.js
console.warn("Встановлення Node.js: \n https://nodejs.org/en/download/");
//? ✴️ Node.js — це відкрите середовище виконання JavaScript,
//? яке дозволяє виконувати JavaScript на стороні сервера.
//? Це означає, що з Node.js можна створювати серверні додатки,
//? які можуть обробляти запити від клієнтів, доступ до баз даних,
//? роботу з файлами, мережеві операції та багато іншого.

//? ✴️ Node.js був створений на основі двигуна V8,
//? який є основою для браузера Google Chrome.
//? Це дозволяє виконувати JavaScript з високою швидкістю і ефективністю.
//? Node.js також має велику кількість розширень (модулів),
//? які дозволяють легко додавати різноманітні функції до ваших додатків.

console.warn("Перевірка версії Node.js:");
console.log(
    `%c
    node -v
    `,
    'color: blue; font-size: 18px',
);
console.log("----------------------------------");

console.warn("Створення нового файла (test.js):");
console.log(
    `%c
    touch test.js
    `,
    'color: blue; font-size: 18px',
);
console.log("----------------------------------");

console.warn("Запуск файлу test.js:");
console.log(
    `%c
    node test.js
    `,
    'color: blue; font-size: 18px',
);
console.log("----------------------------------");

console.warn("Основні команди:");
console.log(
    `%c
    pwd — показує поточну дерикторію, де ви знаходитесь
    ls — показати які файли і папки
    clear — очистити термінал або ctrl+l
    ls -l — показати всі файли
    ls -la — показати разом з прихованими файлами
    cd — навгація по папкам
    cd D: — виходить на диск D
    touch — створює новий файл
    mv — переіменовує/переміщує файл або папку
    rm — видаляє файл або папку
    mkdir — створює нову папку
    `,
    'color: blue; font-size: 18px',
);
console.log("--------------------------------------------------------------------------------------");
