console.log(
    '%c 4.Ініціалізація проєкту.  \n   npm-скрипти.            ',
    'color: white; background-color: #D33F49',
);

//! Ініціалізація проєкту - npm init або npm init --yes
console.warn("Ініціалізація проєкту - npm init або npm init --yes:");
//? ✴️ Кожен проєкт починається зі створення файлу package.json
//? - він відстежує залежності, містить службову інформацію,
//? дозволяє писати npm-скрипти і слугує інструкцією
//? під час створення нового проєкту на основі вже готових налаштувань.
//? Файл package.json можна створити npm-командою init, що ініціалізує
//? проект в цій папці.

//? ✳️ Вам буде запропоновано ввести назву проекту, версію, опис тощо.
//? Можна просто натискати Enter доти, доки не буде створений package.json
//? і розміщений в папці проекту. Щоб не натискати Enter,
//? пропускаючи порожні поля, використовується команда init з прапорцем --yes.
//? Прапорець - додаткове налаштування для команди.
console.log(
    `%c
    npm init
        або
    npm init --yes
    `,
    'color: blue; font-size: 18px',
);
console.log("-------------------------------------------------------------------");

//! npm-скрипти
console.warn("npm-скрипти:");
//? ✴️ Скрипти дозволяють запускати для виконання встановлені пакети. 
//? Використовуючи npm-скрипти, можна створювати цілі системи збирання проєкту. 
//? Автоматизуємо запуск index.js. 
//? Для цього у файлі package.json в полі scripts додамо скрипт запуску start.
console.log(
    `%c
    "scripts": {
    "test": "echo \"Error: no test specified\" && exit 1",
    "start": "node test.js"
    },
    `,
    'color: blue; font-size: 18px',
);



console.log("-------------------------------------------------------------------");
