console.log(
    '%c 5.Встановлення пакетів.              \n   Використання пакетів.              \n   Видалення пакетів.                 \n   Встановлення певної версії пакета. \n   Керування версіями пакетів.        \n   Керування кешем.                   ',
    'color: white; background-color: #D33F49',
);

//! Встановлення пакетів.
console.warn("Встановлення пакетів.:");
console.warn(`Зображення​​: \n ${((window.location.href).split('/')).slice(0, -2).join('/') + '/'}${"lesson-FE4_04/images/image-1.png"}`);
console.warn("Посилання: \n https://caniuse.com/?search=loading%3D%22lazy%22");

//? ✴️
//? ✳️ 

//?     📌 ---:
//? 🔸 ООО.
//? 🔸 ООО.
//? 🔸 ООО.


console.log(
    `%c
    <
        ......
    />
    `,
    'color: blue; font-size: 18px',
);

console.log("-------------------------------------------------------------------");
